Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/system/component/soc/8735b/fwlib/rtl8735b/source/ram/rtl8735b_audio.c
/**************************************************************************//**
 * @file     rtl8735b_audio.c
 * @brief    This file implements the AUDIO HAL functions in ROM.
 *
 * @version  V1.00
 * @date     2016-07-20
 *
 * @note
 *
 ******************************************************************************
 *
 * Copyright(c) 2007 - 2017 Realtek Corporation. All rights reserved.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the License); you may
 * not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 * http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an AS IS BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 ******************************************************************************/

#include "cmsis.h"
#include "rtl8735b_audio.h"
#include "hal_sys_ctrl.h"
#include "hal_sys_ctrl_nsc.h"
#include "hal_timer.h"

#if !defined(CONFIG_BUILD_NONSECURE)

#undef SI_REG_BASE
#define SI_REG_BASE (SI_S_BASE)

#else

#undef SI_REG_BASE
#define SI_REG_BASE (SI_BASE)

#endif


/**
  * @brief The stubs functions table to exports audio HAL functions in ROM.
  */
const hal_audio_func_stubs_t hal_audio_stubs = {
	.hal_audio_init = hal_rtl_audio_init,
	.hal_audio_deinit = hal_rtl_audio_deinit,
	.hal_audio_si_init = hal_rtl_audio_si_init,
	.hal_audio_si_read = hal_rtl_audio_si_read,
	.hal_audio_si_write = hal_rtl_audio_si_write,
	.hal_audio_ldo_tune = hal_rtl_audio_ldo_tune,
	.hal_audio_dev_ctrl = hal_rtl_audio_dev_ctrl,
	.hal_audio_rate = hal_rtl_audio_rate,
	.hal_audio_format = hal_rtl_audio_format,
	.hal_audio_length = hal_rtl_audio_length,
	.hal_audio_sck_inv = hal_rtl_audio_sck_inv,
	.hal_audio_loopback = hal_rtl_audio_loopback,
	.hal_audio_tx_ch = hal_rtl_audio_tx_ch,
	.hal_audio_rx_ch = hal_rtl_audio_rx_ch,
	.hal_audio_digital_rst = hal_rtl_audio_digital_rst,
	.hal_audio_daad_loopback = hal_rtl_audio_daad_loopback,
	.hal_audio_adda_loopback = hal_rtl_audio_adda_loopback,
	.hal_audio_asrc = hal_rtl_audio_asrc,
	.hal_audio_dac_mixer = hal_rtl_audio_dac_mixer,
	.hal_audio_adc_amic_mixer = hal_rtl_audio_adc_amic_mixer,
	.hal_audio_adc_dmic_mixer = hal_rtl_audio_adc_dmic_mixer,
	.hal_audio_sidetone_mixer = hal_rtl_audio_sidetone_mixer,
	.hal_audio_dac_clk = hal_rtl_audio_dac_clk,
	.hal_audio_adc_clk = hal_rtl_audio_adc_clk,
	.hal_audio_dmic_clk = hal_rtl_audio_dmic_clk,
	.hal_audio_dmic_input_clk = hal_rtl_audio_dmic_input_clk,
	.hal_audio_dmic_latch = hal_rtl_audio_dmic_latch,
	.hal_audio_dmic_l_gain = hal_rtl_audio_dmic_l_gain,
	.hal_audio_dmic_r_gain = hal_rtl_audio_dmic_r_gain,
	.hal_audio_dmic_l_src = hal_rtl_audio_dmic_l_src,
	.hal_audio_dmic_r_src = hal_rtl_audio_dmic_r_src,
	.hal_audio_amic_l_src = hal_rtl_audio_amic_l_src,
	.hal_audio_amic_r_src = hal_rtl_audio_amic_r_src,
	.hal_audio_adc_l_hpf = hal_rtl_audio_adc_l_hpf,
	.hal_audio_adc_r_hpf = hal_rtl_audio_adc_r_hpf,
	.hal_audio_adc_l_dvol = hal_rtl_audio_adc_l_dvol,
	.hal_audio_adc_l_dmute = hal_rtl_audio_adc_l_dmute,
	.hal_audio_adc_r_dvol = hal_rtl_audio_adc_r_dvol,
	.hal_audio_adc_r_dmute = hal_rtl_audio_adc_r_dmute,
	.hal_audio_adc_l_zdet = hal_rtl_audio_adc_l_zdet,
	.hal_audio_adc_r_zdet = hal_rtl_audio_adc_r_zdet,
	.hal_audio_adc_l_silence = hal_rtl_audio_adc_l_silence,
	.hal_audio_adc_l_silence_result = hal_rtl_audio_adc_l_silence_result,
	.hal_audio_adc_l_silence_status = hal_rtl_audio_adc_l_silence_status,
	.hal_audio_adc_r_silence = hal_rtl_audio_adc_r_silence,
	.hal_audio_adc_r_silence_result = hal_rtl_audio_adc_r_silence_result,
	.hal_audio_adc_r_silence_status = hal_rtl_audio_adc_r_silence_status,
	.hal_audio_dac_dither = hal_rtl_audio_dac_dither,
	.hal_audio_dac_l_hpf = hal_rtl_audio_dac_l_hpf,
	.hal_audio_dac_l_dvol = hal_rtl_audio_dac_l_dvol,
	.hal_audio_dac_l_dmute = hal_rtl_audio_dac_l_dmute,
	.hal_audio_dac_l_zdet = hal_rtl_audio_dac_l_zdet,
	.hal_audio_dac_l_silence = hal_rtl_audio_dac_l_silence,
	.hal_audio_dac_l_silence_result = hal_rtl_audio_dac_l_silence_result,
	.hal_audio_dac_l_silence_status = hal_rtl_audio_dac_l_silence_status,
	.hal_audio_l_sidetone_hpf = hal_rtl_audio_l_sidetone_hpf,
	.hal_audio_r_sidetone_hpf = hal_rtl_audio_r_sidetone_hpf,
	.hal_audio_l_sidetone_vol = hal_rtl_audio_l_sidetone_vol,
	.hal_audio_r_sidetone_vol = hal_rtl_audio_r_sidetone_vol,
	.hal_audio_ad_da_clk_power = hal_rtl_audio_ad_da_clk_power,
	.hal_audio_dac_power = hal_rtl_audio_dac_power,
	.hal_audio_adc_power = hal_rtl_audio_adc_power,
	.hal_audio_output_power = hal_rtl_audio_output_power,
	.hal_audio_input_power = hal_rtl_audio_input_power,
	.hal_audio_hpo_capless_mode = hal_rtl_audio_hpo_capless_mode,
	.hal_audio_hpo_capless_depop = hal_rtl_audio_hpo_capless_depop,
	.hal_audio_hpo_amplifier = hal_rtl_audio_hpo_amplifier,
	.hal_audio_hpo_depop = hal_rtl_audio_hpo_depop,
	.hal_audio_hpo_power = hal_rtl_audio_hpo_power,
	.hal_audio_hpo_mute_depop = hal_rtl_audio_hpo_mute_depop,
	.hal_audio_hpo_op_depop = hal_rtl_audio_hpo_op_depop,
	.hal_audio_hpo_mute = hal_rtl_audio_hpo_mute,
	.hal_audio_hpo_differential_mode = hal_rtl_audio_hpo_differential_mode,
	.hal_audio_mic_bias = hal_rtl_audio_mic_bias,
	.hal_audio_mic_differential_mode = hal_rtl_audio_mic_differential_mode,
	.hal_audio_mic_mute = hal_rtl_audio_mic_mute,
	.hal_audio_line_in_mute = hal_rtl_audio_line_in_mute,
	.hal_audio_mic_boost = hal_rtl_audio_mic_boost,
	.hal_audio_vref = hal_rtl_audio_vref,
	.hal_audio_ip_tcon = hal_rtl_audio_ip_tcon,
	.hal_audio_sport_init = hal_rtl_audio_sport_init,
	.hal_audio_sport_deinit = hal_rtl_audio_sport_deinit,
	.hal_audio_sport_tx_params = hal_rtl_audio_sport_tx_params,
	.hal_audio_sport_rx_params = hal_rtl_audio_sport_rx_params,
	.hal_audio_sport_buf = hal_rtl_audio_sport_buf,
	.hal_audio_sport_tx_cb_handler = hal_rtl_audio_sport_tx_cb_handler,
	.hal_audio_sport_rx_cb_handler = hal_rtl_audio_sport_rx_cb_handler,
	.hal_audio_sport_get_tx_page   = hal_rtl_audio_sport_get_tx_page,
	.hal_audio_sport_tx_page_send  = hal_rtl_audio_sport_tx_page_send,
	.hal_audio_sport_rx_page_recv  = hal_rtl_audio_sport_rx_page_recv,
	.hal_audio_sport_tx_dma_start  = hal_rtl_audio_sport_tx_dma_start,
	.hal_audio_sport_rx_dma_start  = hal_rtl_audio_sport_rx_dma_start,
	.hal_audio_sport_get_tx_dma_start_sta  = hal_rtl_audio_sport_get_tx_dma_start_sta,
	.hal_audio_sport_get_rx_dma_start_sta  = hal_rtl_audio_sport_get_rx_dma_start_sta,
	.hal_audio_sport_tx_byte_swap  = hal_rtl_audio_sport_tx_byte_swap,
	.hal_audio_sport_rx_byte_swap  = hal_rtl_audio_sport_rx_byte_swap,
	.hal_audio_sport_tx_start  = hal_rtl_audio_sport_tx_start,
	.hal_audio_sport_rx_start  = hal_rtl_audio_sport_rx_start,
	.hal_audio_sport_diff_rate_init = hal_rtl_audio_sport_diff_rate_init,
	.hal_audio_input_l_eq = hal_rtl_audio_input_l_eq,
	.hal_audio_input_r_eq = hal_rtl_audio_input_r_eq,
	.hal_audio_output_l_eq = hal_rtl_audio_output_l_eq,
};

/**
 *  @brief Initialize the AUDIO hardware and turn on the AUDIO.
 *
 *  @param[in] paudio_adapter The AUDIO adapter.
 *  @param[in] audio_codec_power Select audio codec LDO power. 0: 1.8V, 1: 2.8V.
 *
 *  @returns void
 */
void hal_rtl_audio_init(hal_audio_adapter_t *paudio_adapter, audio_codec_power_t audio_codec_power)
{
	u16 audio_codec_index_02h;

	paudio_adapter->si_base_addr = (SI_Type *)SI_REG_BASE;

