Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/system/component/soc/8735b/fwlib/rtl8735b/source/ram/rtl8735b_audio.c
	hal_sys_peripheral_en(SI_SYS, ENABLE);

	//Use internal audio codec
	hal_sys_peripheral_en(AUDIO_CODEC_EXTE_EN, DISABLE);

	//Init Audio Codec enable and clock
	hal_rtl_audio_dev_ctrl(ENABLE);

	//Init Audio Porb
	hal_sys_peripheral_en(AUDIO_CODEC_PORB_EN, ENABLE);

	//Init SI (Serial Interface)
	hal_rtl_audio_si_init(paudio_adapter, ENABLE);

	//MBIAS POW
	audio_codec_index_02h = hal_rtl_audio_si_read(paudio_adapter, 0x02);
	audio_codec_index_02h |= AUDIO_CODEC_BIT_MBIAS_POW;
	hal_rtl_audio_si_write(paudio_adapter, 0x02, audio_codec_index_02h);

	//LDO POW
	hal_delay_us(2);
	hal_rtl_audio_ldo_tune(audio_codec_power);
	hal_sys_peripheral_en(AUDIO_CODEC_LDO_EN, ENABLE);

	//Audio Codec En
	hal_rtl_audio_ip_tcon(paudio_adapter, ENABLE);

}

/**
 *  @brief De-initialize of the AUDIO hardware and turn off the AUDIO.
 *
 *  @param[in] paudio_adapter The AUDIO adapter.
 *
 *  @returns void
 */
void hal_rtl_audio_deinit(hal_audio_adapter_t *paudio_adapter)
{
	//Deinit LDO POW
	hal_sys_peripheral_en(AUDIO_CODEC_LDO_EN, DISABLE);

	//Deinit SI (Serial Interface)
	hal_sys_peripheral_en(SI_SYS, DISABLE);

	//Deinit Audio Porb
	hal_sys_peripheral_en(AUDIO_CODEC_PORB_EN, DISABLE);

	//Deinit Audio
	hal_rtl_audio_dev_ctrl(DISABLE);
}

/**
 *  @brief Control the communication interface of the audio codec for reading or writing the register.
 *
 *  @param[in] paudio_adapter The AUDIO adapter.
 *  @param[in] en  Enable control: 0 is disable, 1 is enable.
 *
 *  @returns void
 */
void hal_rtl_audio_si_init(hal_audio_adapter_t *paudio_adapter, BOOL en)
{
	SI_TypeDef *psi_reg = (SI_TypeDef *)paudio_adapter->si_base_addr;
	u32 temp_reg;

	temp_reg = psi_reg->SI_CLK_CTRL;

	temp_reg &= ~(SI_BIT_REG_DK_EN);

	temp_reg |= (en << SI_SHIFT_REG_DK_EN);

	psi_reg->SI_CLK_CTRL = temp_reg;
}

/**
 *  @brief Read the register of the audio codec.
 *
 *  @param[in] paudio_adapter The AUDIO adapter.
 *  @param[in] address  The register address.
 *
 *  @returns The register value.
 */
u16 hal_rtl_audio_si_read(hal_audio_adapter_t *paudio_adapter, u8 address)
{
	SI_TypeDef *psi_reg = (SI_TypeDef *)paudio_adapter->si_base_addr;
	u32 temp_reg;

	if ((psi_reg->SI_CTRL & SI_BIT_READ_START) == SI_BIT_READ_START) {
		DBG_AUDIO_WARN("hal_rtl_audio_si_read: before still in reading \r\n");
	}

	temp_reg = psi_reg->SI_CTRL;
	temp_reg &= ~(SI_MASK_ADDRESS);
	temp_reg |= ((address << SI_SHIFT_ADDRESS) | SI_BIT_READ_START);
	psi_reg->SI_CTRL = temp_reg;

	while (1) {
		if ((psi_reg->SI_CTRL & SI_BIT_READ_START) == 0) {
			break;
		}
	}

	return ((psi_reg->SI_CTRL & SI_MASK_DATA) >> SI_SHIFT_DATA);
}

/**
 *  @brief Write the register of the audio codec.
 *
 *  @param[in] paudio_adapter The AUDIO adapter.
 *  @param[in] address  The register address.
 *  @param[in] data  The register value to be written.
 *
 *  @return     HAL_ERR_PARA
 *  @return     HAL_OK
 */
HAL_Status hal_rtl_audio_si_write(hal_audio_adapter_t *paudio_adapter, u8 address, u16 data)
{
	SI_TypeDef *psi_reg = (SI_TypeDef *)paudio_adapter->si_base_addr;
	u16 si_read_data;
	u32 temp_reg;

	if ((psi_reg->SI_CTRL & SI_BIT_WR_START) == SI_BIT_WR_START) {
		DBG_AUDIO_WARN("hal_audio_si_write: before still in writing \r\n");
		return HAL_BUSY;
	}

	temp_reg = psi_reg->SI_CTRL;
	temp_reg &= ~(SI_MASK_ADDRESS | SI_MASK_DATA);
	temp_reg |= ((address << SI_SHIFT_ADDRESS) | (data << SI_SHIFT_DATA) | SI_BIT_WR_START);
	psi_reg->SI_CTRL = temp_reg;

	while (1) {
		if ((psi_reg->SI_CTRL & SI_BIT_WR_START) == 0) {
			break;
		}
	}

#if 1
	si_read_data = hal_rtl_audio_si_read(paudio_adapter, address);
	DBG_AUDIO_INFO("0x%2x: 0x%4x \r\n", address, si_read_data);
#endif

	return HAL_OK;
}

/**
 *  @brief Select audio codec LDO power.
 *  @details Select audio codec LDO power 1.8V or 2.8V.
 *  @param[in]   sel  Select codec LDO power.
 *                 - 0 = LDO power 1.8V.
 *                 - 1 = LDO power 2.8V.
 *  @return      void
 *
 */
void hal_rtl_audio_ldo_tune(u8 sel)
{
	u8 power_tune;

	if (sel == 0) {
		power_tune = 0x5F;
	} else {
		power_tune = 0x20;
	}

	hal_sys_set_clk(AUDIO_CODEC_LDO_TUNE, power_tune);
}

/**
 *  @brief Audio codec device enable control.
 *  @details Enable or disable the audio codec device function, clock and pins.
 *  @param[in]   en  The enable control.
 *                 - 1 = Enable.
 *                 - 0 = Disable.
 *  @return      void
 *
 */
void hal_rtl_audio_dev_ctrl(BOOL en)
{
	if (en) {
		hal_sys_peripheral_en(AUDIO_CODEC_SCLK_EN, ENABLE);
		hal_sys_peripheral_en(AUDIO_CODEC_EN, ENABLE);
	} else {
		hal_sys_peripheral_en(AUDIO_CODEC_EN, DISABLE);
		hal_sys_peripheral_en(AUDIO_CODEC_SCLK_EN, DISABLE);
	}
}

/**
 *  @brief Set the sample rate of the audio codec.
 *
 *  @param[in] paudio_adapter The AUDIO adapter.
 *  @param[in] audio_sample_rate  Sample rate.
 *
 *  @returns void
 */
void hal_rtl_audio_rate(hal_audio_adapter_t *paudio_adapter, audio_sample_rate_t audio_tx_rate, audio_sample_rate_t audio_rx_rate)
{
	u16 audio_codec_index_17h;

	audio_codec_index_17h = hal_rtl_audio_si_read(paudio_adapter, 0x17);

	audio_codec_index_17h &= ~(AUDIO_CODEC_MASK_DAC_SAMPLE_RATE | AUDIO_CODEC_MASK_ADC_SAMPLE_RATE);
	audio_codec_index_17h |= (audio_tx_rate << AUDIO_CODEC_SHIFT_DAC_SAMPLE_RATE);
	audio_codec_index_17h |= (audio_rx_rate << AUDIO_CODEC_SHIFT_ADC_SAMPLE_RATE);

	hal_rtl_audio_si_write(paudio_adapter, 0x17, audio_codec_index_17h);
}

/**
 *  @brief Set the format of the audio codec.
 *
 *  @param[in] paudio_adapter The AUDIO adapter.
 *  @param[in] audio_format  Select the interface format.
 *
 *  @returns void
 */
void hal_rtl_audio_format(hal_audio_adapter_t *paudio_adapter, audio_format_t audio_format)
{
	u16 audio_codec_index_10h;

	audio_codec_index_10h = hal_rtl_audio_si_read(paudio_adapter, 0x10);

	audio_codec_index_10h &= ~(AUDIO_CODEC_MASK_I2S_DATA_FORMAT_SEL_TX | AUDIO_CODEC_MASK_I2S_DATA_FORMAT_SEL_RX);
	audio_codec_index_10h |= (audio_format << AUDIO_CODEC_SHIFT_I2S_DATA_FORMAT_SEL_TX);
	audio_codec_index_10h |= (audio_format << AUDIO_CODEC_SHIFT_I2S_DATA_FORMAT_SEL_RX);

	hal_rtl_audio_si_write(paudio_adapter, 0x10, audio_codec_index_10h);
}

/**
 *  @brief Set the data length of the audio codec.
 *
 *  @param[in] paudio_adapter The AUDIO adapter.
 *  @param[in] audio_word_len  The data length.
 *
 *  @returns void
 */
void hal_rtl_audio_length(hal_audio_adapter_t *paudio_adapter, audio_word_len_t audio_tx_word_len, audio_word_len_t audio_rx_word_len)
{
	u16 audio_codec_index_10h;

	audio_codec_index_10h = hal_rtl_audio_si_read(paudio_adapter, 0x10);

	audio_codec_index_10h &= ~(AUDIO_CODEC_MASK_I2S_DATA_LEN_SEL_TX | AUDIO_CODEC_MASK_I2S_DATA_LEN_SEL_RX);
	audio_codec_index_10h |= (audio_tx_word_len << AUDIO_CODEC_SHIFT_I2S_DATA_LEN_SEL_TX);
	audio_codec_index_10h |= (audio_rx_word_len << AUDIO_CODEC_SHIFT_I2S_DATA_LEN_SEL_RX);

	hal_rtl_audio_si_write(paudio_adapter, 0x10, audio_codec_index_10h);
}

/**
 *  @brief Invert the SCK of the audio codec.
 *
 *  @param[in] paudio_adapter The AUDIO adapter.
 *  @param[in] sck_inv_en  Enable control: 0 is disable, 1 is enable.
 *
 *  @returns void
 */
void hal_rtl_audio_sck_inv(hal_audio_adapter_t *paudio_adapter, BOOL sck_inv_en)
{
	u16 audio_codec_index_10h;

	audio_codec_index_10h = hal_rtl_audio_si_read(paudio_adapter, 0x10);

	audio_codec_index_10h &= ~(AUDIO_CODEC_BIT_INV_I2S_SCLK);
	audio_codec_index_10h |= (sck_inv_en << AUDIO_CODEC_SHIFT_INV_I2S_SCLK);

	hal_rtl_audio_si_write(paudio_adapter, 0x10, audio_codec_index_10h);
}

/**
 *  @brief Control the interface loopback mode of the audio codec. This direction is tx to rx.
 *
 *  @param[in] paudio_adapter The AUDIO adapter.
 *  @param[in] sck_inv_en  Enable control: 0 is disable, 1 is enable.
 *
 *  @returns void
 */
void hal_rtl_audio_loopback(hal_audio_adapter_t *paudio_adapter, BOOL loopback_en)
{
	u16 audio_codec_index_10h;

	audio_codec_index_10h = hal_rtl_audio_si_read(paudio_adapter, 0x10);

	audio_codec_index_10h &= ~(AUDIO_CODEC_BIT_STEREO_I2S_SELF_LPBK_EN);
	audio_codec_index_10h |= (loopback_en << AUDIO_CODEC_SHIFT_STEREO_I2S_SELF_LPBK_EN);

	hal_rtl_audio_si_write(paudio_adapter, 0x10, audio_codec_index_10h);
}

/**
 *  @brief Control the tx data format of the audio codec.
 *
 *  @param[in] paudio_adapter The AUDIO adapter.
 *  @param[in] audio_sel_ch  Set the relation between the data and channel.
 *                      -00: L/R.
 *                      -01: R/L.
 *                      -10: L/L.
 *                      -11: R/R.
 *
 *  @returns void
 */
void hal_rtl_audio_tx_ch(hal_audio_adapter_t *paudio_adapter, audio_sel_ch_t audio_sel_ch)
{
	u16 audio_codec_index_10h;

	audio_codec_index_10h = hal_rtl_audio_si_read(paudio_adapter, 0x10);

	audio_codec_index_10h &= ~(AUDIO_CODEC_MASK_SEL_I2S_TX_CH);
	audio_codec_index_10h |= (audio_sel_ch << AUDIO_CODEC_SHIFT_SEL_I2S_TX_CH);

	hal_rtl_audio_si_write(paudio_adapter, 0x10, audio_codec_index_10h);
}

/**
 *  @brief Control the rx data format of the audio codec.
 *
 *  @param[in] paudio_adapter The AUDIO adapter.
 *  @param[in] audio_sel_ch  Set the relation between the data and channel.
 *                      -00: L/R.
 *                      -01: R/L.
 *                      -10: L/L.
 *                      -11: R/R.
 *
 *  @returns void
 */
void hal_rtl_audio_rx_ch(hal_audio_adapter_t *paudio_adapter, audio_sel_ch_t audio_sel_ch)
{
	u16 audio_codec_index_10h;

	audio_codec_index_10h = hal_rtl_audio_si_read(paudio_adapter, 0x10);

	audio_codec_index_10h &= ~(AUDIO_CODEC_MASK_SEL_I2S_RX_CH);
	audio_codec_index_10h |= (audio_sel_ch << AUDIO_CODEC_SHIFT_SEL_I2S_RX_CH);

	hal_rtl_audio_si_write(paudio_adapter, 0x10, audio_codec_index_10h);
}

/**
 *  @brief Reset the the digital IP of the audio codec.
 *
 *  @param[in] paudio_adapter The AUDIO adapter.
 *  @param[in] en  Enable control: 0 is disable, 1 is enable.
 *
 *  @returns void
 */
void hal_rtl_audio_digital_rst(hal_audio_adapter_t *paudio_adapter, BOOL en)
{
	u16 audio_codec_index_10h;
	u8 rst_dis_en = 0;

	if (en == 0) {
		rst_dis_en = 1;
	}

	audio_codec_index_10h = hal_rtl_audio_si_read(paudio_adapter, 0x10);

	audio_codec_index_10h &= ~(AUDIO_CODEC_BIT_I2S_RST_N_REG);
	audio_codec_index_10h |= (rst_dis_en << AUDIO_CODEC_SHIFT_I2S_RST_N_REG);

	hal_rtl_audio_si_write(paudio_adapter, 0x10, audio_codec_index_10h);
}

/**
 *  @brief Control the DAC & ADC loopback. This direction is tx to rx.
 *
 *  @param[in] paudio_adapter The AUDIO adapter.
 *  @param[in] loopback_en  Enable control: 0 is disable, 1 is enable.
 *
 *  @returns void
 */
void hal_rtl_audio_daad_loopback(hal_audio_adapter_t *paudio_adapter, BOOL loopback_en)
{
	u16 audio_codec_index_fbh;

	audio_codec_index_fbh = hal_rtl_audio_si_read(paudio_adapter, 0xfb);

	audio_codec_index_fbh &= ~(AUDIO_CODEC_BIT_DAAD_LPBK_EN);
	audio_codec_index_fbh |= (loopback_en << AUDIO_CODEC_SHIFT_DAAD_LPBK_EN);

	hal_rtl_audio_si_write(paudio_adapter, 0xfb, audio_codec_index_fbh);
}

/**
 *  @brief Control the DAC & ADC loopback. This direction is rx to tx.
 *
 *  @param[in] paudio_adapter The AUDIO adapter.
 *  @param[in] loopback_en  Enable control: 0 is disable, 1 is enable.
 *
 *  @returns void
 */
void hal_rtl_audio_adda_loopback(hal_audio_adapter_t *paudio_adapter, BOOL loopback_en)
{
	u16 audio_codec_index_fdh;

	audio_codec_index_fdh = hal_rtl_audio_si_read(paudio_adapter, 0xfd);

	audio_codec_index_fdh &= ~(AUDIO_CODEC_BIT_ADDA_LPBK_EN);
	audio_codec_index_fdh |= (loopback_en << AUDIO_CODEC_SHIFT_ADDA_LPBK_EN);

	hal_rtl_audio_si_write(paudio_adapter, 0xfd, audio_codec_index_fdh);
}

/**
 *  @brief Control the ASRC of the audio codec.
 *
 *  @param[in] paudio_adapter The AUDIO adapter.
 *  @param[in] asrc_en  Enable control: 0 is disable, 1 is enable.
 *
 *  @returns void
 */
void hal_rtl_audio_asrc(hal_audio_adapter_t *paudio_adapter, BOOL asrc_en)
{
	u16 audio_codec_index_1bh;

