Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/system/component/soc/8735b/fwlib/rtl8735b/source/ram/rtl8735b_audio.c
	audio_codec_index_1bh = hal_rtl_audio_si_read(paudio_adapter, 0x1b);

	audio_codec_index_1bh &= ~(AUDIO_CODEC_BIT_ASRC_TX_EN | AUDIO_CODEC_BIT_ASRC_RX_EN);
	audio_codec_index_1bh |= (asrc_en << AUDIO_CODEC_SHIFT_ASRC_TX_EN);
	audio_codec_index_1bh |= (asrc_en << AUDIO_CODEC_SHIFT_ASRC_RX_EN);

	hal_rtl_audio_si_write(paudio_adapter, 0x1b, audio_codec_index_1bh);
}

/**
 *  @brief Control the mute mixer of DAC.
 *         Only support the left channel.
 *
 *  @param[in] paudio_adapter The AUDIO adapter.
 *  @param[in] dac_l_mute_en  Mute control: 0 is disable, 1 is enable.
 *
 *  @returns void
 */
void hal_rtl_audio_dac_mixer(hal_audio_adapter_t *paudio_adapter, BOOL dac_l_mute_en)
{
	u16 audio_codec_index_fbh;

	audio_codec_index_fbh = hal_rtl_audio_si_read(paudio_adapter, 0xfb);

	audio_codec_index_fbh &= ~(AUDIO_CODEC_BIT_DAC_L_DMIX_MUTE_128FS_DA);
	audio_codec_index_fbh |= (dac_l_mute_en << AUDIO_CODEC_SHIFT_DAC_L_DMIX_MUTE_128FS_DA);

	hal_rtl_audio_si_write(paudio_adapter, 0xfb, audio_codec_index_fbh);
}

/**
 *  @brief Control the mute mixer of amic.
 *         Only support the left channel.
 *
 *  @param[in] paudio_adapter The AUDIO adapter.
 *  @param[in] amic_l_mute_en  Mute control: 0 is disable, 1 is enable.
 *  @param[in] amic_r_mute_en  Mute control: 0 is disable, 1 is enable.
 *
 *  @returns void
 */
void hal_rtl_audio_adc_amic_mixer(hal_audio_adapter_t *paudio_adapter, BOOL amic_l_mute_en, BOOL amic_r_mute_en)
{
	u16 audio_codec_index_11h;
	u16 audio_codec_index_14h;

	audio_codec_index_11h = hal_rtl_audio_si_read(paudio_adapter, 0x11);
	audio_codec_index_14h = hal_rtl_audio_si_read(paudio_adapter, 0x14);

	audio_codec_index_11h &= ~(AUDIO_CODEC_BIT_ADC_L_AD_MIX_MUTE);
	audio_codec_index_11h |= (amic_l_mute_en << AUDIO_CODEC_SHIFT_ADC_L_AD_MIX_MUTE);

	audio_codec_index_14h &= ~(AUDIO_CODEC_BIT_ADC_R_AD_MIX_MUTE);
	audio_codec_index_14h |= (amic_r_mute_en << AUDIO_CODEC_SHIFT_ADC_R_AD_MIX_MUTE);

	hal_rtl_audio_si_write(paudio_adapter, 0x11, audio_codec_index_11h);
	hal_rtl_audio_si_write(paudio_adapter, 0x14, audio_codec_index_14h);
}

/**
 *  @brief Control the mute mixer of dmic.
 *         Only support the left channel.
 *
 *  @param[in] paudio_adapter The AUDIO adapter.
 *  @param[in] dmic_l_mute_en  Mute control: 0 is disable, 1 is enable.
 *  @param[in] dmic_r_mute_en  Mute control: 0 is disable, 1 is enable.
 *
 *  @returns void
 */
void hal_rtl_audio_adc_dmic_mixer(hal_audio_adapter_t *paudio_adapter, BOOL dmic_l_mute_en, BOOL dmic_r_mute_en)
{
	u16 audio_codec_index_11h;
	u16 audio_codec_index_14h;

	audio_codec_index_11h = hal_rtl_audio_si_read(paudio_adapter, 0x11);
	audio_codec_index_14h = hal_rtl_audio_si_read(paudio_adapter, 0x14);

	audio_codec_index_11h &= ~(AUDIO_CODEC_BIT_ADC_L_DMIC_MIX_MUTE);
	audio_codec_index_11h |= (dmic_l_mute_en << AUDIO_CODEC_SHIFT_ADC_L_DMIC_MIX_MUTE);

	audio_codec_index_14h &= ~(AUDIO_CODEC_BIT_ADC_R_DMIC_MIX_MUTE);
	audio_codec_index_14h |= (dmic_r_mute_en << AUDIO_CODEC_SHIFT_ADC_R_DMIC_MIX_MUTE);

	hal_rtl_audio_si_write(paudio_adapter, 0x11, audio_codec_index_11h);
	hal_rtl_audio_si_write(paudio_adapter, 0x14, audio_codec_index_14h);
}

/**
 *  @brief Control the sidetone mixer.
 *
 *  @param[in] paudio_adapter The AUDIO adapter.
 *  @param[in] sidetone_l_mute_en  Mute control: 0 is disable, 1 is enable.
 *
 *  @returns void
 */
void hal_rtl_audio_sidetone_mixer(hal_audio_adapter_t *paudio_adapter, BOOL sidetone_l_mute_en)
{
	u16 audio_codec_index_fbh;

	audio_codec_index_fbh = hal_rtl_audio_si_read(paudio_adapter, 0xfb);

	audio_codec_index_fbh &= ~(AUDIO_CODEC_BIT_DAC_L_DMIX_MUTE_128FS_SIDETONE);
	audio_codec_index_fbh |= (sidetone_l_mute_en << AUDIO_CODEC_SHIFT_DAC_L_DMIX_MUTE_128FS_SIDETONE);

	hal_rtl_audio_si_write(paudio_adapter, 0xfb, audio_codec_index_fbh);
}

/**
 *  @brief Control the DAC clock.
 *
 *  @param[in] paudio_adapter The AUDIO adapter.
 *  @param[in] dac_l_clk_en  Control the left channel clock: 0 is disable, 1 is enable.
 *
 *  @returns void
 */
void hal_rtl_audio_dac_clk(hal_audio_adapter_t *paudio_adapter, BOOL dac_l_clk_en)
{
	u16 audio_codec_index_18h;

	audio_codec_index_18h = hal_rtl_audio_si_read(paudio_adapter, 0x18);

	audio_codec_index_18h &= ~(AUDIO_CODEC_BIT_DA_L_EN);
	audio_codec_index_18h |= (dac_l_clk_en << AUDIO_CODEC_SHIFT_DA_L_EN);
	audio_codec_index_18h &= ~(AUDIO_CODEC_BIT_MOD_L_EN);
	audio_codec_index_18h |= (dac_l_clk_en << AUDIO_CODEC_SHIFT_MOD_L_EN);

	audio_codec_index_18h &= ~(AUDIO_CODEC_BIT_DA_ANA_CLK_EN | AUDIO_CODEC_BIT_DA_FIFO_EN);

	if (dac_l_clk_en == 1) {
		audio_codec_index_18h |= (AUDIO_CODEC_BIT_DA_ANA_CLK_EN | AUDIO_CODEC_BIT_DA_FIFO_EN);
	}

	hal_rtl_audio_si_write(paudio_adapter, 0x18, audio_codec_index_18h);
}

/**
 *  @brief Control the ADC clock.
 *
 *  @param[in] paudio_adapter The AUDIO adapter.
 *  @param[in] adc_l_clk_en  Control the left channel clock: 0 is disable, 1 is enable.
 *  @param[in] adc_r_clk_en  Control the right channel clock: 0 is disable, 1 is enable.
 *
 *  @returns void
 */
void hal_rtl_audio_adc_clk(hal_audio_adapter_t *paudio_adapter, BOOL adc_l_clk_en, BOOL adc_r_clk_en)
{
	u16 audio_codec_index_18h;

	audio_codec_index_18h = hal_rtl_audio_si_read(paudio_adapter, 0x18);

	audio_codec_index_18h &= ~(AUDIO_CODEC_BIT_AD_L_EN);
	audio_codec_index_18h |= (adc_l_clk_en << AUDIO_CODEC_SHIFT_AD_L_EN);
	audio_codec_index_18h &= ~(AUDIO_CODEC_BIT_AD_R_EN);
	audio_codec_index_18h |= (adc_r_clk_en << AUDIO_CODEC_SHIFT_AD_R_EN);

	audio_codec_index_18h &= ~(AUDIO_CODEC_BIT_AD_ANA_L_EN);
	audio_codec_index_18h |= (adc_l_clk_en << AUDIO_CODEC_SHIFT_AD_ANA_L_EN);
	audio_codec_index_18h &= ~(AUDIO_CODEC_BIT_AD_ANA_R_EN);
	audio_codec_index_18h |= (adc_r_clk_en << AUDIO_CODEC_SHIFT_AD_ANA_R_EN);

	audio_codec_index_18h &= ~(AUDIO_CODEC_BIT_AD_FIFO_EN);
	audio_codec_index_18h &= ~(AUDIO_CODEC_BIT_AD_ANA_CLK_EN);

	if ((adc_l_clk_en == 1) || (adc_r_clk_en == 1)) {
		audio_codec_index_18h |= AUDIO_CODEC_BIT_AD_FIFO_EN;
		audio_codec_index_18h |= AUDIO_CODEC_BIT_AD_ANA_CLK_EN;
	}

