Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/system/component/soc/8735b/fwlib/rtl8735b/source/ram/rtl8735b_audio.c
	hal_rtl_audio_si_write(paudio_adapter, 0x18, audio_codec_index_18h);
}

/**
 *  @brief Control the D-MIC clock.
 *         This function is not supported.
 *
 *  @param[in] paudio_adapter The AUDIO adapter.
 *  @param[in] dimc_l_clk_en  Control the left channel clock: 0 is disable, 1 is enable.
 *  @param[in] dimc_r_clk_en  Control the right channel clock: 0 is disable, 1 is enable.
 *
 *  @returns void
 */
void hal_rtl_audio_dmic_clk(hal_audio_adapter_t *paudio_adapter, BOOL dimc_l_clk_en, BOOL dimc_r_clk_en)
{
	u16 audio_codec_index_18h;

	audio_codec_index_18h = hal_rtl_audio_si_read(paudio_adapter, 0x18);

	audio_codec_index_18h &= ~(AUDIO_CODEC_BIT_AD_L_EN);
	audio_codec_index_18h |= (dimc_l_clk_en << AUDIO_CODEC_SHIFT_AD_L_EN);
	audio_codec_index_18h &= ~(AUDIO_CODEC_BIT_AD_R_EN);
	audio_codec_index_18h |= (dimc_r_clk_en << AUDIO_CODEC_SHIFT_AD_R_EN);

	audio_codec_index_18h &= ~(AUDIO_CODEC_BIT_DMIC_L_EN);
	audio_codec_index_18h |= (dimc_l_clk_en << AUDIO_CODEC_SHIFT_DMIC_L_EN);
	audio_codec_index_18h &= ~(AUDIO_CODEC_BIT_DMIC_R_EN);
	audio_codec_index_18h |= (dimc_r_clk_en << AUDIO_CODEC_SHIFT_DMIC_R_EN);

	audio_codec_index_18h &= ~(AUDIO_CODEC_BIT_AD_FIFO_EN);
	audio_codec_index_18h &= ~(AUDIO_CODEC_BIT_DMIC_CLK_EN);

	if ((dimc_l_clk_en == 1) || (dimc_r_clk_en == 1)) {
		audio_codec_index_18h |= AUDIO_CODEC_BIT_AD_FIFO_EN;
		audio_codec_index_18h |= AUDIO_CODEC_BIT_DMIC_CLK_EN;
	}

	hal_rtl_audio_si_write(paudio_adapter, 0x18, audio_codec_index_18h);
}

/**
 *  @brief Select the input clock of D-MIC.
 *         This function is not supported.
 *
 *  @param[in] paudio_adapter The AUDIO adapter.
 *  @param[in] dmic_input_clk  The D-MIC clock.
 *                      -0: 5MHz.
 *                      -1: 2.5MHz.
 *                      -2: 1.25MHz.
 *                      -3: 625KHz.
 *                      -4: 312.5KHz.
 *
 *  @returns void
 */
void hal_rtl_audio_dmic_input_clk(hal_audio_adapter_t *paudio_adapter, audio_dmic_input_clk_t dmic_input_clk)
{
	u16 audio_codec_index_17h;

	audio_codec_index_17h = hal_rtl_audio_si_read(paudio_adapter, 0x17);

	audio_codec_index_17h &= ~(AUDIO_CODEC_MASK_DMIC1_CLK_SEL);
	audio_codec_index_17h |= (dmic_input_clk << AUDIO_CODEC_SHIFT_DMIC1_CLK_SEL);

	hal_rtl_audio_si_write(paudio_adapter, 0x17, audio_codec_index_17h);
}

/**
 *  @brief Control the D-MIC latch.
 *
 *  @param[in] paudio_adapter The AUDIO adapter.
 *  @param[in] dmic_l_latch  Control the D-MIC latch of the left channel.
 *  @param[in] dmic_r_latch  Control the D-MIC latch of the right channel.
 *
 *  @returns void
 */
void hal_rtl_audio_dmic_latch(hal_audio_adapter_t *paudio_adapter, audio_dmic_latch_t dmic_l_latch, audio_dmic_latch_t dmic_r_latch)
{
	u16 audio_codec_index_11h;
	u16 audio_codec_index_14h;

	audio_codec_index_11h = hal_rtl_audio_si_read(paudio_adapter, 0x11);
	audio_codec_index_14h = hal_rtl_audio_si_read(paudio_adapter, 0x14);

	audio_codec_index_11h &= ~(AUDIO_CODEC_MASK_ADC_L_DMIC_SRC_SEL);
	audio_codec_index_11h |= (dmic_l_latch << AUDIO_CODEC_SHIFT_ADC_L_DMIC_SRC_SEL);
	audio_codec_index_14h &= ~(AUDIO_CODEC_MASK_ADC_R_DMIC_SRC_SEL);
	audio_codec_index_14h |= (dmic_r_latch << AUDIO_CODEC_SHIFT_ADC_R_DMIC_SRC_SEL);

	hal_rtl_audio_si_write(paudio_adapter, 0x11, audio_codec_index_11h);
	hal_rtl_audio_si_write(paudio_adapter, 0x14, audio_codec_index_14h);
}

/**
 *  @brief Control the D-MIC gain of the left channel.
 *
 *  @param[in] paudio_adapter The AUDIO adapter.
 *  @param[in] dmic_boost  Set the D-MIC boost.
 *
 *  @returns void
 */
void hal_rtl_audio_dmic_l_gain(hal_audio_adapter_t *paudio_adapter, audio_dmic_gain_t dmic_gain)
{
	u16 audio_codec_index_12h;

	audio_codec_index_12h = hal_rtl_audio_si_read(paudio_adapter, 0x12);

	audio_codec_index_12h &= ~(AUDIO_CODEC_MASK_ADC_L_DMIC_BOOST_GAIN);
	audio_codec_index_12h |= (dmic_gain << AUDIO_CODEC_SHIFT_ADC_L_DMIC_BOOST_GAIN);

	hal_rtl_audio_si_write(paudio_adapter, 0x12, audio_codec_index_12h);
}

/**
 *  @brief Control the D-MIC gain of the right channel.
 *
 *  @param[in] paudio_adapter The AUDIO adapter.
 *  @param[in] dmic_boost  Set the D-MIC boost.
 *
 *  @returns void
 */
void hal_rtl_audio_dmic_r_gain(hal_audio_adapter_t *paudio_adapter, audio_dmic_gain_t dmic_gain)
{
	u16 audio_codec_index_15h;

	audio_codec_index_15h = hal_rtl_audio_si_read(paudio_adapter, 0x15);

	audio_codec_index_15h &= ~(AUDIO_CODEC_MASK_ADC_R_DMIC_BOOST_GAIN);
	audio_codec_index_15h |= (dmic_gain << AUDIO_CODEC_SHIFT_ADC_R_DMIC_BOOST_GAIN);

	hal_rtl_audio_si_write(paudio_adapter, 0x15, audio_codec_index_15h);
}

/**
 *  @brief Control the D-MIC SRC filter of the left channel.
 *         This function is not supported.
 *
 *  @param[in] paudio_adapter The AUDIO adapter.
 *  @param[in] lp_1st_en  Control the 1nd LPF: 0 is disable, 1 is enable.
 *  @param[in] lp_2st_en  Control the 2nd LPF: 0 is disable, 1 is enable.
 *  @param[in] src_freq  Set the 1st LPF fc.
 *
 *  @returns void
 */
void hal_rtl_audio_dmic_l_src(hal_audio_adapter_t *paudio_adapter, BOOL lp_1st_en, BOOL lp_2st_en, audio_src_freq_t src_freq)
{
	u16 audio_codec_index_11h;

	audio_codec_index_11h = hal_rtl_audio_si_read(paudio_adapter, 0x11);

	audio_codec_index_11h &= ~(AUDIO_CODEC_BIT_ADC_L_DMIC_LPF1ST_EN);
	audio_codec_index_11h |= (lp_1st_en << AUDIO_CODEC_SHIFT_ADC_L_DMIC_LPF1ST_EN);
	audio_codec_index_11h &= ~(AUDIO_CODEC_BIT_ADC_L_DMIC_LPF2ND_EN);
	audio_codec_index_11h |= (lp_2st_en << AUDIO_CODEC_SHIFT_ADC_L_DMIC_LPF2ND_EN);
	audio_codec_index_11h &= ~(AUDIO_CODEC_MASK_ADC_L_DMIC_LPF1ST_FC_SEL);
	audio_codec_index_11h |= (src_freq << AUDIO_CODEC_SHIFT_ADC_L_DMIC_LPF1ST_FC_SEL);

	hal_rtl_audio_si_write(paudio_adapter, 0x11, audio_codec_index_11h);
}

/**
 *  @brief Control the D-MIC SRC filter of the right channel.
 *         This function is not supported.
 *
 *  @param[in] paudio_adapter The AUDIO adapter.
 *  @param[in] lp_1st_en  Control the 1nd LPF: 0 is disable, 1 is enable.
 *  @param[in] lp_2st_en  Control the 2nd LPF: 0 is disable, 1 is enable.
 *  @param[in] src_freq  Set the 1st LPF fc.
 *
 *  @returns void
 */
void hal_rtl_audio_dmic_r_src(hal_audio_adapter_t *paudio_adapter, BOOL lp_1st_en, BOOL lp_2st_en, audio_src_freq_t src_freq)
{
	u16 audio_codec_index_14h;

