Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/system/component/soc/8735b/fwlib/rtl8735b/source/ram/rtl8735b_audio.c
	audio_codec_index_14h = hal_rtl_audio_si_read(paudio_adapter, 0x14);

	audio_codec_index_14h &= ~(AUDIO_CODEC_BIT_ADC_R_DMIC_LPF1ST_EN);
	audio_codec_index_14h |= (lp_1st_en << AUDIO_CODEC_SHIFT_ADC_R_DMIC_LPF1ST_EN);
	audio_codec_index_14h &= ~(AUDIO_CODEC_BIT_ADC_R_DMIC_LPF2ND_EN);
	audio_codec_index_14h |= (lp_2st_en << AUDIO_CODEC_SHIFT_ADC_R_DMIC_LPF2ND_EN);
	audio_codec_index_14h &= ~(AUDIO_CODEC_MASK_ADC_R_DMIC_LPF1ST_FC_SEL);
	audio_codec_index_14h |= (src_freq << AUDIO_CODEC_SHIFT_ADC_R_DMIC_LPF1ST_FC_SEL);

	hal_rtl_audio_si_write(paudio_adapter, 0x14, audio_codec_index_14h);
}

/**
 *  @brief Control the A-MIC SRC filter of the left channel.
 *
 *  @param[in] paudio_adapter The AUDIO adapter.
 *  @param[in] lp_1st_en  Control the 1nd LPF: 0 is disable, 1 is enable.
 *  @param[in] lp_2st_en  Control the 2nd LPF: 0 is disable, 1 is enable.
 *  @param[in] src_freq  Set the 1st LPF fc.
 *
 *  @returns void
 */
void hal_rtl_audio_amic_l_src(hal_audio_adapter_t *paudio_adapter, BOOL lp_1st_en, BOOL lp_2st_en, audio_src_freq_t src_freq)
{
	u16 audio_codec_index_11h;

	audio_codec_index_11h = hal_rtl_audio_si_read(paudio_adapter, 0x11);

	audio_codec_index_11h &= ~(AUDIO_CODEC_BIT_ADC_L_AD_LPF1ST_EN);
	audio_codec_index_11h |= (lp_1st_en << AUDIO_CODEC_SHIFT_ADC_L_AD_LPF1ST_EN);
	audio_codec_index_11h &= ~(AUDIO_CODEC_BIT_ADC_L_AD_LPF2ND_EN);
	audio_codec_index_11h |= (lp_2st_en << AUDIO_CODEC_SHIFT_ADC_L_AD_LPF2ND_EN);
	audio_codec_index_11h &= ~(AUDIO_CODEC_MASK_ADC_L_AD_LPF1ST_FC_SEL);
	audio_codec_index_11h |= (src_freq << AUDIO_CODEC_SHIFT_ADC_L_AD_LPF1ST_FC_SEL);

	hal_rtl_audio_si_write(paudio_adapter, 0x11, audio_codec_index_11h);
}

/**
 *  @brief Control the A-MIC SRC filter of the right channel.
 *         This function is not supported.
 *
 *  @param[in] paudio_adapter The AUDIO adapter.
 *  @param[in] lp_1st_en  Control the 1nd LPF: 0 is disable, 1 is enable.
 *  @param[in] lp_2st_en  Control the 2nd LPF: 0 is disable, 1 is enable.
 *  @param[in] src_freq  Set the 1st LPF fc.
 *
 *  @returns void
 */
void hal_rtl_audio_amic_r_src(hal_audio_adapter_t *paudio_adapter, BOOL lp_1st_en, BOOL lp_2st_en, audio_src_freq_t src_freq)
{
	u16 audio_codec_index_14h;

	audio_codec_index_14h = hal_rtl_audio_si_read(paudio_adapter, 0x14);

	audio_codec_index_14h &= ~(AUDIO_CODEC_BIT_ADC_R_AD_LPF1ST_EN);
	audio_codec_index_14h |= (lp_1st_en << AUDIO_CODEC_SHIFT_ADC_R_AD_LPF1ST_EN);
	audio_codec_index_14h &= ~(AUDIO_CODEC_BIT_ADC_R_AD_LPF2ND_EN);
	audio_codec_index_14h |= (lp_2st_en << AUDIO_CODEC_SHIFT_ADC_R_AD_LPF2ND_EN);
	audio_codec_index_14h &= ~(AUDIO_CODEC_MASK_ADC_R_AD_LPF1ST_FC_SEL);
	audio_codec_index_14h |= (src_freq << AUDIO_CODEC_SHIFT_ADC_R_AD_LPF1ST_FC_SEL);

	hal_rtl_audio_si_write(paudio_adapter, 0x14, audio_codec_index_14h);
}

/**
 *  @brief Control the ADC high pass filter of the left channel.
 *
 *  @param[in] paudio_adapter The AUDIO adapter.
 *  @param[in] en  Control the HPF: 0 is disable, 1 is enable.
 *  @param[in] audio_hpf_fc Set the cutoff frequency.
 *                      -0:  The cutoff frequency is 0.005*fs.
 *                      -1:  The cutoff frequency is 0.0025*fs.
 *                      -2:  The cutoff frequency is 0.00125*fs.
 *                      -3:  The cutoff frequency is 0.000625*fs.
 *                      -4:  The cutoff frequency is 0.0003125*fs.
 *                      -5:  The cutoff frequency is 0.00015625*fs.
 *                      -6:  The cutoff frequency is 0.000078125*fs.
 *                      -7:  The cutoff frequency is 0.0000390625*fs.
 *
 *  @returns void
 */
void hal_rtl_audio_adc_l_hpf(hal_audio_adapter_t *paudio_adapter, BOOL en, audio_hpf_fc_t audio_hpf_fc)
{
	u16 audio_codec_index_11h;
	u16 audio_codec_index_13h;

	audio_codec_index_11h = hal_rtl_audio_si_read(paudio_adapter, 0x11);
	audio_codec_index_11h &= ~(AUDIO_CODEC_BIT_ADC_L_AD_DCHPF_EN);
	hal_rtl_audio_si_write(paudio_adapter, 0x11, audio_codec_index_11h);

	if (en == ENABLE) {
		audio_codec_index_13h = hal_rtl_audio_si_read(paudio_adapter, 0x13);
		audio_codec_index_13h &= ~(AUDIO_CODEC_MASK_ADC_L_DCHPF_FC_SEL);
		audio_codec_index_13h |= (audio_hpf_fc << AUDIO_CODEC_SHIFT_ADC_L_DCHPF_FC_SEL);
		hal_rtl_audio_si_write(paudio_adapter, 0x13, audio_codec_index_13h);

		audio_codec_index_11h = hal_rtl_audio_si_read(paudio_adapter, 0x11);
		audio_codec_index_11h |= (0x01 << AUDIO_CODEC_SHIFT_ADC_L_AD_DCHPF_EN);
		hal_rtl_audio_si_write(paudio_adapter, 0x11, audio_codec_index_11h);
	}
}

/**
 *  @brief Control the ADC high pass filter of the right channel.
 *         This function is not supported.
 *
 *  @param[in] paudio_adapter The AUDIO adapter.
 *  @param[in] en  Control the HPF: 0 is disable, 1 is enable.
 *  @param[in] audio_hpf_fc Set the cutoff frequency.
 *                      -0:  The cutoff frequency is 0.005*fs.
 *                      -1:  The cutoff frequency is 0.0025*fs.
 *                      -2:  The cutoff frequency is 0.00125*fs.
 *                      -3:  The cutoff frequency is 0.000625*fs.
 *                      -4:  The cutoff frequency is 0.0003125*fs.
 *                      -5:  The cutoff frequency is 0.00015625*fs.
 *                      -6:  The cutoff frequency is 0.000078125*fs.
 *                      -7:  The cutoff frequency is 0.0000390625*fs.
 *
 *  @returns void
 */
void hal_rtl_audio_adc_r_hpf(hal_audio_adapter_t *paudio_adapter, BOOL en, audio_hpf_fc_t audio_hpf_fc)
{
	u16 audio_codec_index_14h;
	u16 audio_codec_index_16h;

	audio_codec_index_14h = hal_rtl_audio_si_read(paudio_adapter, 0x14);
	audio_codec_index_14h &= ~(AUDIO_CODEC_BIT_ADC_R_AD_DCHPF_EN);
	hal_rtl_audio_si_write(paudio_adapter, 0x14, audio_codec_index_14h);

	if (en == ENABLE) {
		audio_codec_index_16h = hal_rtl_audio_si_read(paudio_adapter, 0x16);
		audio_codec_index_16h &= ~(AUDIO_CODEC_MASK_ADC_R_DCHPF_FC_SEL);
		audio_codec_index_16h |= (audio_hpf_fc << AUDIO_CODEC_SHIFT_ADC_R_DCHPF_FC_SEL);
		hal_rtl_audio_si_write(paudio_adapter, 0x16, audio_codec_index_16h);

