Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/system/component/soc/8735b/fwlib/rtl8735b/source/ram/rtl8735b_audio.c
		audio_codec_index_14h = hal_rtl_audio_si_read(paudio_adapter, 0x14);
		audio_codec_index_14h |= (0x01 << AUDIO_CODEC_SHIFT_ADC_R_AD_DCHPF_EN);
		hal_rtl_audio_si_write(paudio_adapter, 0x14, audio_codec_index_14h);
	}
}

/**
 *  @brief Control the ADC digital volume of the left channel.
 *
 *  @param[in] paudio_adapter The AUDIO adapter.
 *  @param[in] step  The digital volume. Every Step is 0.375dB.
 *         The value 0x7F is 30dB.
 *         The value 0x2F is 0dB.
 *         The value 0x00 is -17.625dB.
 *
 *  @returns void
 */
void hal_rtl_audio_adc_l_dvol(hal_audio_adapter_t *paudio_adapter, u8 step)
{
	u16 audio_codec_index_13h;

	audio_codec_index_13h = hal_rtl_audio_si_read(paudio_adapter, 0x13);

	audio_codec_index_13h &= ~(AUDIO_CODEC_MASK_ADC_L_AD_GAIN);
	audio_codec_index_13h |= (step << AUDIO_CODEC_SHIFT_ADC_L_AD_GAIN);

	hal_rtl_audio_si_write(paudio_adapter, 0x13, audio_codec_index_13h);
}

/**
 *  @brief Control the ADC digital mute of the left channel.
 *
 *  @param[in] paudio_adapter The AUDIO adapter.
 *  @param[in] mute_en  Enable control: 0 is disable, 1 is enable.
 *
 *  @returns void
 */
void hal_rtl_audio_adc_l_dmute(hal_audio_adapter_t *paudio_adapter, BOOL mute_en)
{
	u16 audio_codec_index_12h;

	audio_codec_index_12h = hal_rtl_audio_si_read(paudio_adapter, 0x12);

	audio_codec_index_12h &= ~(AUDIO_CODEC_BIT_ADC_L_AD_MUTE);
	audio_codec_index_12h |= (mute_en << AUDIO_CODEC_SHIFT_ADC_L_AD_MUTE);

	hal_rtl_audio_si_write(paudio_adapter, 0x12, audio_codec_index_12h);
}

/**
 *  @brief Control the ADC digital volume of the right channel.
 *         This function is not supported.
 *
 *  @param[in] paudio_adapter The AUDIO adapter.
 *  @param[in] step  The digital volume. Every Step is 0.375dB.
 *         The value 0x7F is 30dB.
 *         The value 0x2F is 0dB.
 *         The value 0x00 is -17.625dB.
 *
 *  @returns void
 */
void hal_rtl_audio_adc_r_dvol(hal_audio_adapter_t *paudio_adapter, u8 step)
{
	u16 audio_codec_index_16h;

	audio_codec_index_16h = hal_rtl_audio_si_read(paudio_adapter, 0x16);

	audio_codec_index_16h &= ~(AUDIO_CODEC_MASK_ADC_R_AD_GAIN);
	audio_codec_index_16h |= (step << AUDIO_CODEC_SHIFT_ADC_R_AD_GAIN);

	hal_rtl_audio_si_write(paudio_adapter, 0x16, audio_codec_index_16h);
}

/**
 *  @brief Control the ADC digital mute of the right channel.
 *         This function is not supported.
 *
 *  @param[in] paudio_adapter The AUDIO adapter.
 *  @param[in] mute_en  Enable control: 0 is disable, 1 is enable.
 *
 *  @returns void
 */
void hal_rtl_audio_adc_r_dmute(hal_audio_adapter_t *paudio_adapter, BOOL mute_en)
{
	u16 audio_codec_index_15h;

	audio_codec_index_15h = hal_rtl_audio_si_read(paudio_adapter, 0x15);

	audio_codec_index_15h &= ~(AUDIO_CODEC_BIT_ADC_R_AD_MUTE);
	audio_codec_index_15h |= (mute_en << AUDIO_CODEC_SHIFT_ADC_R_AD_MUTE);

	hal_rtl_audio_si_write(paudio_adapter, 0x15, audio_codec_index_15h);
}

/**
 *  @brief Control the ADC zero detection function of the left channel.
 *
 *  @param[in] paudio_adapter The AUDIO adapter.
 *  @param[in] zdet  The detection control.
 *  @param[in] audio_adc_zdet_tout_t  Set the detection timeout.
 *
 *  @returns void
 */
void hal_rtl_audio_adc_l_zdet(hal_audio_adapter_t *paudio_adapter, audio_zdet_t zdet, audio_adc_zdet_tout_t adc_zdet_tout)
{
	u16 audio_codec_index_12h;

	audio_codec_index_12h = hal_rtl_audio_si_read(paudio_adapter, 0x12);

	audio_codec_index_12h &= ~(AUDIO_CODEC_MASK_ADC_L_AD_ZDET_FUNC);
	audio_codec_index_12h |= (zdet << AUDIO_CODEC_SHIFT_ADC_L_AD_ZDET_FUNC);
	audio_codec_index_12h &= ~(AUDIO_CODEC_MASK_ADC_L_AD_ZDET_TOUT);
	audio_codec_index_12h |= (adc_zdet_tout << AUDIO_CODEC_SHIFT_ADC_L_AD_ZDET_TOUT);

	hal_rtl_audio_si_write(paudio_adapter, 0x12, audio_codec_index_12h);
}

/**
 *  @brief Control the ADC zero detection function of the right channel.
 *         This function is not supported.
 *
 *  @param[in] paudio_adapter The AUDIO adapter.
 *  @param[in] zdet  The detection control.
 *  @param[in] audio_adc_zdet_tout_t  Set the detection timeout.
 *
 *  @returns void
 */
void hal_rtl_audio_adc_r_zdet(hal_audio_adapter_t *paudio_adapter, audio_zdet_t zdet, audio_adc_zdet_tout_t adc_zdet_tout)
{
	u16 audio_codec_index_15h;

	audio_codec_index_15h = hal_rtl_audio_si_read(paudio_adapter, 0x15);

	audio_codec_index_15h &= ~(AUDIO_CODEC_MASK_ADC_R_AD_ZDET_FUNC);
	audio_codec_index_15h |= (zdet << AUDIO_CODEC_SHIFT_ADC_R_AD_ZDET_FUNC);
	audio_codec_index_15h &= ~(AUDIO_CODEC_MASK_ADC_R_AD_ZDET_TOUT);
	audio_codec_index_15h |= (adc_zdet_tout << AUDIO_CODEC_SHIFT_ADC_R_AD_ZDET_TOUT);

	hal_rtl_audio_si_write(paudio_adapter, 0x15, audio_codec_index_15h);
}

/**
 *  @brief Control the ADC silence detection function of the left channel.
 *
 *  @param[in] paudio_adapter The AUDIO adapter.
 *  @param[in] silence_en  Enable control: 0 is disable, 1 is enable.
 *  @param[in] detect_sel  The detection control.
 *  @param[in] debounce_time  Set the detection timeout.
 *
 *  @returns void
 */
void hal_rtl_audio_adc_l_silence(hal_audio_adapter_t *paudio_adapter, BOOL silence_en, audio_silence_Level_t level, audio_silence_debounce_t debounce_time)
{
	u16 audio_codec_index_f8h;

	audio_codec_index_f8h = hal_rtl_audio_si_read(paudio_adapter, 0xf8);

	audio_codec_index_f8h &= ~(AUDIO_CODEC_BIT_ADC_L_SILENCE_DET_MONO_EN);
	audio_codec_index_f8h |= (silence_en << AUDIO_CODEC_SHIFT_ADC_L_SILENCE_DET_MONO_EN);
	audio_codec_index_f8h &= ~(AUDIO_CODEC_MASK_ADC_L_SILENCE_MONO_LEVEL_SEL);
	audio_codec_index_f8h |= (level << AUDIO_CODEC_SHIFT_ADC_L_SILENCE_MONO_LEVEL_SEL);
	audio_codec_index_f8h &= ~(AUDIO_CODEC_MASK_ADC_L_SILENCE_MONO_DEBOUNCE_SEL);
	audio_codec_index_f8h |= (debounce_time << AUDIO_CODEC_SHIFT_ADC_L_SILENCE_MONO_DEBOUNCE_SEL);

	hal_rtl_audio_si_write(paudio_adapter, 0xf8, audio_codec_index_f8h);
}

/**
 *  @brief Get the ADC silence detection result of the left channel.
 *
 *  @param[in] paudio_adapter The AUDIO adapter.
 *
 *  @return     0:  The silence is not detected.
 *  @return     1:  The silence is detected.
 */
u8 hal_rtl_audio_adc_l_silence_result(hal_audio_adapter_t *paudio_adapter)
{
	u16 audio_codec_index_f8h;
	u8 result;

	audio_codec_index_f8h = hal_rtl_audio_si_read(paudio_adapter, 0xf8);

	result = (audio_codec_index_f8h & AUDIO_CODEC_BIT_ADC_L_SILENCE_DET_MONO_O) >> AUDIO_CODEC_SHIFT_ADC_L_SILENCE_DET_MONO_O;

	return result;
}

/**
 *  @brief Get the ADC silence detection status of the right channel.
 *
 *  @param[in] paudio_adapter The AUDIO adapter.
 *
 *  @return     0:  The detection is resting.
 *  @return     1:  The detection is working.
 */
u8 hal_rtl_audio_adc_l_silence_status(hal_audio_adapter_t *paudio_adapter)
{
	u16 audio_codec_index_f8h;
	u8 result;

	audio_codec_index_f8h = hal_rtl_audio_si_read(paudio_adapter, 0xf8);

