Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/system/component/soc/8735b/fwlib/rtl8735b/source/ram/rtl8735b_audio.c
	result = (audio_codec_index_f8h & AUDIO_CODEC_BIT_ADC_L_SILENECE_DET_MONO_STATUS) >> AUDIO_CODEC_SHIFT_ADC_L_SILENECE_DET_MONO_STATUS;

	return result;
}

/**
 *  @brief Control the ADC silence detection function of the right channel.
 *         This function is not supported.
 *
 *  @param[in] paudio_adapter The AUDIO adapter.
 *  @param[in] silence_en  Enable control: 0 is disable, 1 is enable.
 *  @param[in] detect_sel  The detection control.
 *  @param[in] debounce_time  Set the detection timeout.
 *
 *  @returns void
 */
void hal_rtl_audio_adc_r_silence(hal_audio_adapter_t *paudio_adapter, BOOL silence_en, audio_silence_Level_t level, audio_silence_debounce_t debounce_time)
{
	u16 audio_codec_index_f9h;

	audio_codec_index_f9h = hal_rtl_audio_si_read(paudio_adapter, 0xf9);

	audio_codec_index_f9h &= ~(AUDIO_CODEC_BIT_ADC_R_SILENCE_DET_MONO_EN);
	audio_codec_index_f9h |= (silence_en << AUDIO_CODEC_SHIFT_ADC_R_SILENCE_DET_MONO_EN);
	audio_codec_index_f9h &= ~(AUDIO_CODEC_MASK_ADC_R_SILENCE_MONO_LEVEL_SEL);
	audio_codec_index_f9h |= (level << AUDIO_CODEC_SHIFT_ADC_R_SILENCE_MONO_LEVEL_SEL);
	audio_codec_index_f9h &= ~(AUDIO_CODEC_MASK_ADC_R_SILENCE_MONO_DEBOUNCE_SEL);
	audio_codec_index_f9h |= (debounce_time << AUDIO_CODEC_SHIFT_ADC_R_SILENCE_MONO_DEBOUNCE_SEL);

	hal_rtl_audio_si_write(paudio_adapter, 0xf9, audio_codec_index_f9h);
}

/**
 *  @brief Get the ADC silence detection result of the right channel.
 *         This function is not supported.
 *
 *  @param[in] paudio_adapter The AUDIO adapter.
 *
 *  @return     0:  The silence is not detected.
 *  @return     1:  The silence is detected.
 */
u8 hal_rtl_audio_adc_r_silence_result(hal_audio_adapter_t *paudio_adapter)
{
	u16 audio_codec_index_f9h;
	u8 result;

	audio_codec_index_f9h = hal_rtl_audio_si_read(paudio_adapter, 0xf9);

	result = (audio_codec_index_f9h & AUDIO_CODEC_BIT_ADC_R_SILENCE_DET_MONO_O) >> AUDIO_CODEC_SHIFT_ADC_R_SILENCE_DET_MONO_O;

	return result;
}

/**
 *  @brief Get the ADC silence detection status of the right channel.
 *         This function is not supported.
 *
 *  @param[in] paudio_adapter The AUDIO adapter.
 *
 *  @return     0:  The detection is resting.
 *  @return     1:  The detection is working.
 */
u8 hal_rtl_audio_adc_r_silence_status(hal_audio_adapter_t *paudio_adapter)
{
	u16 audio_codec_index_f9h;
	u8 result;

	audio_codec_index_f9h = hal_rtl_audio_si_read(paudio_adapter, 0xf9);

	result = (audio_codec_index_f9h & AUDIO_CODEC_BIT_ADC_R_SILENECE_DET_MONO_STATUS) >> AUDIO_CODEC_SHIFT_ADC_R_SILENECE_DET_MONO_STATUS;

	return result;
}

/**
 *  @brief Control the DAC dither.
 *
 *  @param[in] paudio_adapter The AUDIO adapter.
 *  @param[in] dac_l_dither Control the dither of the left channel.
 *                      -0: Disable.
 *                      -1: LSB.
 *                      -2: LSB + 1.
 *                      -3: LSB + 2.
 *  @param[in] dac_r_dither Control the dither of the right channel.  This function is not supported.
 *                      -0: Disable.
 *                      -1: LSB.
 *                      -2: LSB + 1.
 *                      -3: LSB + 2.
 *
 *  @returns void
 */
void hal_rtl_audio_dac_dither(hal_audio_adapter_t *paudio_adapter, audio_dac_dither_t dac_l_dither)
{
	u16 audio_codec_index_fah;

	audio_codec_index_fah = hal_rtl_audio_si_read(paudio_adapter, 0xfa);

	audio_codec_index_fah &= ~(AUDIO_CODEC_MASK_DAC_L_DA_DITHER_SEL);
	audio_codec_index_fah |= (dac_l_dither << AUDIO_CODEC_SHIFT_DAC_L_DA_DITHER_SEL);

	hal_rtl_audio_si_write(paudio_adapter, 0xfa, audio_codec_index_fah);
}

/**
 *  @brief Control the DAC high pass filter of the left channel.
 *
 *  @param[in] paudio_adapter The AUDIO adapter.
 *  @param[in] en  Control the HPF: 0 is disable, 1 is enable.
 *
 *  @returns void
 */
void hal_rtl_audio_dac_l_hpf(hal_audio_adapter_t *paudio_adapter, BOOL en)
{
	u16 audio_codec_index_fah;

	audio_codec_index_fah = hal_rtl_audio_si_read(paudio_adapter, 0xfa);

	audio_codec_index_fah &= ~(AUDIO_CODEC_BIT_DAC_L_DAHPF_EN);
	audio_codec_index_fah |= (en << AUDIO_CODEC_SHIFT_DAC_L_DAHPF_EN);

	hal_rtl_audio_si_write(paudio_adapter, 0xfa, audio_codec_index_fah);
}

/**
 *  @brief Control the DAC digital volume of the left channel.
 *
 *  @param[in] paudio_adapter The AUDIO adapter.
 *  @param[in] step  The digital volume. Every Step is 0.375dB.
 *         The value 0xAF is 0dB.
 *         The value 0x00 is -65.625dB.
 *
 *  @returns void
 */

void hal_rtl_audio_dac_l_dvol(hal_audio_adapter_t *paudio_adapter, u8 step)

{
	u16 audio_codec_index_fah;

	audio_codec_index_fah = hal_rtl_audio_si_read(paudio_adapter, 0xfa);

	audio_codec_index_fah &= ~(AUDIO_CODEC_MASK_DAC_L_DA_GAIN);
	audio_codec_index_fah |= (step << AUDIO_CODEC_SHIFT_DAC_L_DA_GAIN);

	hal_rtl_audio_si_write(paudio_adapter, 0xfa, audio_codec_index_fah);
}

/**
 *  @brief Control the DAC digital mute of the left channel.
 *
 *  @param[in] paudio_adapter The AUDIO adapter.
 *  @param[in] mute_en  Enable control: 0 is disable, 1 is enable.
 *
 *  @returns void
 */
void hal_rtl_audio_dac_l_dmute(hal_audio_adapter_t *paudio_adapter, BOOL mute_en)
{
	u16 audio_codec_index_fbh;

	audio_codec_index_fbh = hal_rtl_audio_si_read(paudio_adapter, 0xfb);

	audio_codec_index_fbh &= ~(AUDIO_CODEC_BIT_DAC_L_DA_MUTE);
	audio_codec_index_fbh |= (mute_en << AUDIO_CODEC_SHIFT_DAC_L_DA_MUTE);

	hal_rtl_audio_si_write(paudio_adapter, 0xfb, audio_codec_index_fbh);
}

/**
 *  @brief Control the DAC zero detection function of the left channel.
 *
 *  @param[in] paudio_adapter The AUDIO adapter.
 *  @param[in] zdet  The detection control.
 *  @param[in] audio_adc_zdet_tout_t  Set the detection timeout.
 *
 *  @returns void
 */
void hal_rtl_audio_dac_l_zdet(hal_audio_adapter_t *paudio_adapter, audio_zdet_t zdet, audio_dac_zdet_tout_t adc_zdet_tout)
{
	u16 audio_codec_index_fah;

	audio_codec_index_fah = hal_rtl_audio_si_read(paudio_adapter, 0xfa);

	audio_codec_index_fah &= ~(AUDIO_CODEC_MASK_DAC_L_DA_ZDET_FUNC);
	audio_codec_index_fah |= (zdet << AUDIO_CODEC_SHIFT_DAC_L_DA_ZDET_FUNC);

