Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/system/component/soc/8735b/fwlib/rtl8735b/source/ram/rtl8735b_audio.c
	audio_codec_index_fah &= ~(AUDIO_CODEC_MASK_DAC_L_DA_ZDET_TOUT);
	audio_codec_index_fah |= (adc_zdet_tout << AUDIO_CODEC_SHIFT_DAC_L_DA_ZDET_TOUT);

	hal_rtl_audio_si_write(paudio_adapter, 0xfa, audio_codec_index_fah);
}

/**
 *  @brief Control the DAC silence detection function of the left channel.
 *
 *  @param[in] paudio_adapter The AUDIO adapter.
 *  @param[in] silence_en  Enable control: 0 is disable, 1 is enable.
 *  @param[in] debounce_time  Set the detection timeout.
 *
 *  @returns void
 */
void hal_rtl_audio_dac_l_silence(hal_audio_adapter_t *paudio_adapter, BOOL silence_en, audio_silence_Level_t level, audio_silence_debounce_t debounce_time)
{
	u16 audio_codec_index_f6h;

	audio_codec_index_f6h = hal_rtl_audio_si_read(paudio_adapter, 0xf6);

	audio_codec_index_f6h &= ~(AUDIO_CODEC_BIT_DAC_L_SILENCE_DET_MONO_EN);
	audio_codec_index_f6h |= (silence_en << AUDIO_CODEC_SHIFT_DAC_L_SILENCE_DET_MONO_EN);

	audio_codec_index_f6h &= ~(AUDIO_CODEC_MASK_DAC_L_SILENCE_MONO_LEVEL_SEL);
	audio_codec_index_f6h |= (level << AUDIO_CODEC_SHIFT_DAC_L_SILENCE_MONO_LEVEL_SEL);

	audio_codec_index_f6h &= ~(AUDIO_CODEC_MASK_DAC_L_SILENCE_MONO_DEBOUNCE_SEL);
	audio_codec_index_f6h |= (debounce_time << AUDIO_CODEC_SHIFT_DAC_L_SILENCE_MONO_DEBOUNCE_SEL);

	hal_rtl_audio_si_write(paudio_adapter, 0xf6, audio_codec_index_f6h);
}

/**
 *  @brief Get the DAC silence detection result of the left channel.
 *
 *  @param[in] paudio_adapter The AUDIO adapter.
 *
 *  @return     0:  The silence is not detected.
 *  @return     1:  The silence is detected.
 */
u8 hal_rtl_audio_dac_l_silence_result(hal_audio_adapter_t *paudio_adapter)
{
	u16 audio_codec_index_f6h;
	u8 result;

	audio_codec_index_f6h = hal_rtl_audio_si_read(paudio_adapter, 0xf6);

	result = (audio_codec_index_f6h & AUDIO_CODEC_BIT_DAC_L_SILENCE_DET_MONO_O) >> AUDIO_CODEC_SHIFT_DAC_L_SILENCE_DET_MONO_O;

	return result;
}

/**
 *  @brief Get the DAC silence detection status of the left channel.
 *
 *  @param[in] paudio_adapter The AUDIO adapter.
 *
 *  @return     0:  The detection is resting.
 *  @return     1:  The detection is working.
 */
u8 hal_rtl_audio_dac_l_silence_status(hal_audio_adapter_t *paudio_adapter)
{
	u16 audio_codec_index_f6h;
	u8 result;

	audio_codec_index_f6h = hal_rtl_audio_si_read(paudio_adapter, 0xf6);

	result = (audio_codec_index_f6h & AUDIO_CODEC_BIT_DAC_L_SILENECE_DET_MONO_STATUS) >> AUDIO_CODEC_SHIFT_DAC_L_SILENECE_DET_MONO_STATUS;

	return result;
}

/**
 *  @brief Control the sidetone high pass filter of the left channel.
 *
 *  @param[in] paudio_adapter The AUDIO adapter.
 *  @param[in] hpf_en  Enable Narrow-band 1st HPF : 0 is disable, 1 is enable.
 *  @param[in] sidetone_hpf  Select the sidetone HPF cut-off frequency.
 *
 *  @returns void
 */
void hal_rtl_audio_l_sidetone_hpf(hal_audio_adapter_t *paudio_adapter, BOOL hpf_en, audio_sidetone_hpf_t sidetone_hpf)
{
	u16 audio_codec_index_0eh;

	audio_codec_index_0eh = hal_rtl_audio_si_read(paudio_adapter, 0x0e);

	audio_codec_index_0eh &= ~(AUDIO_CODEC_BIT_SIDETONE_L_HPF_EN);
	audio_codec_index_0eh |= (hpf_en << AUDIO_CODEC_SHIFT_SIDETONE_L_HPF_EN);

	audio_codec_index_0eh &= ~(AUDIO_CODEC_MASK_SIDETONE_L_HPF_FC_SEL);
	audio_codec_index_0eh |= (sidetone_hpf << AUDIO_CODEC_SHIFT_SIDETONE_L_HPF_FC_SEL);

	hal_rtl_audio_si_write(paudio_adapter, 0x0e, audio_codec_index_0eh);
}

/**
 *  @brief Control the sidetone high pass filter of the right channel.
 *
 *  @param[in] paudio_adapter The AUDIO adapter.
 *  @param[in] hpf_en  Enable Narrow-band 1st HPF : 0 is disable, 1 is enable.
 *  @param[in] sidetone_hpf  Select the sidetone HPF cut-off frequency.
 *
 *  @returns void
 */
void hal_rtl_audio_r_sidetone_hpf(hal_audio_adapter_t *paudio_adapter, BOOL hpf_en, audio_sidetone_hpf_t sidetone_hpf)
{
	u16 audio_codec_index_0fh;

	audio_codec_index_0fh = hal_rtl_audio_si_read(paudio_adapter, 0x0f);

	audio_codec_index_0fh &= ~(AUDIO_CODEC_BIT_SIDETONE_R_HPF_EN);
	audio_codec_index_0fh |= (hpf_en << AUDIO_CODEC_SHIFT_SIDETONE_R_HPF_EN);

	audio_codec_index_0fh &= ~(AUDIO_CODEC_MASK_SIDETONE_R_HPF_FC_SEL);
	audio_codec_index_0fh |= (sidetone_hpf << AUDIO_CODEC_SHIFT_SIDETONE_R_HPF_FC_SEL);

	hal_rtl_audio_si_write(paudio_adapter, 0x0f, audio_codec_index_0fh);
}

/**
 *  @brief Control the sidetone volume of the left channel.
 *
 *  @param[in] paudio_adapter The AUDIO adapter.
 *  @param[in] sidetone_vol  Select the sidetone volume.
 *  @param[in] sidetone_boost  Select the sidetone boost.
 *
 *  @returns void
 */
void hal_rtl_audio_l_sidetone_vol(hal_audio_adapter_t *paudio_adapter, audio_sidetone_vol_t sidetone_vol, audio_sidetone_boost_t sidetone_boost)
{
	u16 audio_codec_index_0eh;

	audio_codec_index_0eh = hal_rtl_audio_si_read(paudio_adapter, 0x0e);

	audio_codec_index_0eh &= ~(AUDIO_CODEC_MASK_SIDETONE_L_VOL_SEL);
	audio_codec_index_0eh |= (sidetone_vol << AUDIO_CODEC_SHIFT_SIDETONE_L_VOL_SEL);

	audio_codec_index_0eh &= ~(AUDIO_CODEC_BIT_SIDETONE_L_BOOST_SEL);
	audio_codec_index_0eh |= (sidetone_boost << AUDIO_CODEC_SHIFT_SIDETONE_L_BOOST_SEL);

	hal_rtl_audio_si_write(paudio_adapter, 0x0e, audio_codec_index_0eh);
}

/**
 *  @brief Control the sidetone volume of the right channel.
 *
 *  @param[in] paudio_adapter The AUDIO adapter.
 *  @param[in] sidetone_vol  Select the sidetone volume.
 *  @param[in] sidetone_boost  Select the sidetone boost.
 *
 *  @returns void
 */
void hal_rtl_audio_r_sidetone_vol(hal_audio_adapter_t *paudio_adapter, audio_sidetone_vol_t sidetone_vol, audio_sidetone_boost_t sidetone_boost)
{
	u16 audio_codec_index_0fh;

	audio_codec_index_0fh = hal_rtl_audio_si_read(paudio_adapter, 0x0f);

	audio_codec_index_0fh &= ~(AUDIO_CODEC_MASK_SIDETONE_R_VOL_SEL);
	audio_codec_index_0fh |= (sidetone_vol << AUDIO_CODEC_SHIFT_SIDETONE_R_VOL_SEL);

	audio_codec_index_0fh &= ~(AUDIO_CODEC_BIT_SIDETONE_R_BOOST_SEL);
	audio_codec_index_0fh |= (sidetone_boost << AUDIO_CODEC_SHIFT_SIDETONE_R_BOOST_SEL);

	hal_rtl_audio_si_write(paudio_adapter, 0x0f, audio_codec_index_0fh);
}

/**
 *  @brief Control the power of the ADC and DAC clock.
 *
 *  @param[in] paudio_adapter The AUDIO adapter.
 *  @param[in] en  Enable control: 0 is disable, 1 is enable.
 *
 *  @returns void
 */
void hal_rtl_audio_ad_da_clk_power(hal_audio_adapter_t *paudio_adapter, BOOL en)
{
	u16 audio_codec_index_00h;

	audio_codec_index_00h = hal_rtl_audio_si_read(paudio_adapter, 0x00);

	audio_codec_index_00h &= ~(AUDIO_CODEC_BIT_DAC_ADDACK_POW);
	audio_codec_index_00h |= (en << AUDIO_CODEC_SHIFT_DAC_ADDACK_POW);

	hal_rtl_audio_si_write(paudio_adapter, 0x00, audio_codec_index_00h);
}

/**
 *  @brief Control the DAC power.
 *
 *  @param[in] paudio_adapter The AUDIO adapter.
 *  @param[in] left_en The left channel control: 0 is disable, 1 is enable.
 *
 *  @returns void
 */
void hal_rtl_audio_dac_power(hal_audio_adapter_t *paudio_adapter, BOOL left_en)
{
	u16 audio_codec_index_00h;

	audio_codec_index_00h = hal_rtl_audio_si_read(paudio_adapter, 0x00);

	audio_codec_index_00h &= ~(AUDIO_CODEC_BIT_DAC_L_POW);
	audio_codec_index_00h |= (left_en << AUDIO_CODEC_SHIFT_DAC_L_POW);

	hal_rtl_audio_si_write(paudio_adapter, 0x00, audio_codec_index_00h);
}

/**
 *  @brief Control the ADC power.
 *
 *  @param[in] paudio_adapter The AUDIO adapter.
 *  @param[in] left_en The left channel control: 0 is disable, 1 is enable.
 *  @param[in] right_en The right channel control: 0 is disable, 1 is enable. This function is not supported.
 *
 *  @returns void
 */
void hal_rtl_audio_adc_power(hal_audio_adapter_t *paudio_adapter, BOOL left_en)
{
	u16 audio_codec_index_00h;

	audio_codec_index_00h = hal_rtl_audio_si_read(paudio_adapter, 0x00);

	audio_codec_index_00h &= ~(AUDIO_CODEC_BIT_DTSDM_POW_L);
	audio_codec_index_00h |= (left_en << AUDIO_CODEC_SHIFT_DTSDM_POW_L);

	hal_rtl_audio_si_write(paudio_adapter, 0x00, audio_codec_index_00h);
}

/**
 *  @brief Control the output power.
 *
 *  @param[in] paudio_adapter The AUDIO adapter.
 *  @param[in] audio_output_mode_t Select the output mode.
 *
 *  @returns void
 */
void hal_rtl_audio_output_power(hal_audio_adapter_t *paudio_adapter, audio_output_mode_t output_mode)
{
	u16 audio_codec_index_00h;
	u16 audio_codec_index_01h;
	u16 audio_codec_index_02h;
	//audio_codec_index_03h_t audio_codec_index_03h;
	u16 audio_codec_index_0ch;
	u16 input_index_00h;
	u16 input_index_02h;

	input_index_00h = hal_rtl_audio_si_read(paudio_adapter, 0x00) & 0x0c00;
	input_index_02h = hal_rtl_audio_si_read(paudio_adapter, 0x02) & 0x7e00;

