Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/system/component/soc/8735b/fwlib/rtl8735b/source/ram/rtl8735b_audio.c
	if (output_mode == AUDIO_OUTPUT_SINGLE_EDNED) {

		DBG_AUDIO_INFO(" hal_audio_output_power, AUDIO_OUTPUT_SINGLE_EDNED\r\n");

		//Step0:
		//audio_codec_index_03h.w = 0x08f0;
		//hal_audio_si_write(paudio_adapter, 0x03, audio_codec_index_03h.w);

		//Step1:
		audio_codec_index_00h = (0x031b | input_index_00h);
		hal_rtl_audio_si_write(paudio_adapter, 0x00, audio_codec_index_00h);
		audio_codec_index_01h = 0x07fc;
		hal_rtl_audio_si_write(paudio_adapter, 0x01, audio_codec_index_01h);
		audio_codec_index_02h = (0x81ea | input_index_02h);
		hal_rtl_audio_si_write(paudio_adapter, 0x02, audio_codec_index_02h);
		audio_codec_index_0ch = 0x0010;
		hal_rtl_audio_si_write(paudio_adapter, 0x0c, audio_codec_index_0ch);

		//Step2:
		audio_codec_index_01h = 0x9ffc;
		hal_rtl_audio_si_write(paudio_adapter, 0x01, audio_codec_index_01h);
		audio_codec_index_02h = (0x81fa | input_index_02h);
		hal_rtl_audio_si_write(paudio_adapter, 0x02, audio_codec_index_02h);

		//Step3:
		audio_codec_index_00h = (0x039b | input_index_00h);
		hal_rtl_audio_si_write(paudio_adapter, 0x00, audio_codec_index_00h);
		audio_codec_index_0ch = 0x0018;
		hal_rtl_audio_si_write(paudio_adapter, 0x0c, audio_codec_index_0ch);

		//Step4:
		//hal_delay_ms(300);

		//Step5:
		audio_codec_index_00h = (0x021b | input_index_00h);
		hal_rtl_audio_si_write(paudio_adapter, 0x00, audio_codec_index_00h);
		audio_codec_index_01h = 0x04fc;
		hal_rtl_audio_si_write(paudio_adapter, 0x01, audio_codec_index_01h);
		audio_codec_index_02h = (0x81ea | input_index_02h);
		hal_rtl_audio_si_write(paudio_adapter, 0x02, audio_codec_index_02h);
		audio_codec_index_0ch = 0x0010;
		hal_rtl_audio_si_write(paudio_adapter, 0x0c, audio_codec_index_0ch);

	} else if (output_mode == AUDIO_OUTPUT_DIFFERENTIAL) {

		DBG_AUDIO_INFO(" hal_audio_output_power, AUDIO_OUTPUT_DIFFERENTIAL\r\n");

		//Step0:
		//audio_codec_index_03h.w = 0x08f0;
		//hal_audio_si_write(paudio_adapter, 0x03, audio_codec_index_03h.w);

		//Step1:
		audio_codec_index_00h = (0x031b | input_index_00h);
		hal_rtl_audio_si_write(paudio_adapter, 0x00, audio_codec_index_00h);
		audio_codec_index_01h = 0x07fc;
		hal_rtl_audio_si_write(paudio_adapter, 0x01, audio_codec_index_01h);
		audio_codec_index_02h = (0x812a | input_index_02h);
		hal_rtl_audio_si_write(paudio_adapter, 0x02, audio_codec_index_02h);
		audio_codec_index_0ch = 0x0010;
		hal_rtl_audio_si_write(paudio_adapter, 0x0c, audio_codec_index_0ch);

		//Step2:
		audio_codec_index_01h = 0x9ffc;
		hal_rtl_audio_si_write(paudio_adapter, 0x01, audio_codec_index_01h);
		audio_codec_index_02h = (0x813a | input_index_02h);
		hal_rtl_audio_si_write(paudio_adapter, 0x02, audio_codec_index_02h);

		//Step3:
		audio_codec_index_00h = (0x039b | input_index_00h);
		hal_rtl_audio_si_write(paudio_adapter, 0x00, audio_codec_index_00h);
		audio_codec_index_0ch = 0x0018;
		hal_rtl_audio_si_write(paudio_adapter, 0x0c, audio_codec_index_0ch);

		//Step4:
		hal_delay_ms(50);

		//Step5:
		audio_codec_index_00h = (0x031b | input_index_00h);
		hal_rtl_audio_si_write(paudio_adapter, 0x00, audio_codec_index_00h);
		audio_codec_index_01h = 0x67fc;
		hal_rtl_audio_si_write(paudio_adapter, 0x01, audio_codec_index_01h);
		audio_codec_index_02h = (0x812a | input_index_02h);
		hal_rtl_audio_si_write(paudio_adapter, 0x02, audio_codec_index_02h);

		//Step6:
		audio_codec_index_00h = (0x039b | input_index_00h);
		hal_rtl_audio_si_write(paudio_adapter, 0x00, audio_codec_index_00h);

		//Step7:
		hal_delay_ms(5);

		//Step8:
		audio_codec_index_01h = 0x04fc;
		hal_rtl_audio_si_write(paudio_adapter, 0x01, audio_codec_index_01h);

		//Step9:
		audio_codec_index_00h = (0x021b | input_index_00h);
		hal_rtl_audio_si_write(paudio_adapter, 0x00, audio_codec_index_00h);
		audio_codec_index_0ch = 0x0010;
		hal_rtl_audio_si_write(paudio_adapter, 0x0c, audio_codec_index_0ch);

	} else if (output_mode == AUDIO_OUTPUT_CAPLESS) {

		DBG_AUDIO_INFO(" hal_audio_output_power, AUDIO_OUTPUT_CAPLESS\r\n");

		//Step0:
		//audio_codec_index_03h.w = 0x08f0;
		//hal_audio_si_write(paudio_adapter, 0x03, audio_codec_index_03h.w);

		//Step1:
		audio_codec_index_00h = (0x131b | input_index_00h);
		hal_rtl_audio_si_write(paudio_adapter, 0x00, audio_codec_index_00h);
		audio_codec_index_01h = 0x07fe;
		hal_rtl_audio_si_write(paudio_adapter, 0x01, audio_codec_index_01h);
		audio_codec_index_02h = (0x81ea | input_index_02h);
		hal_rtl_audio_si_write(paudio_adapter, 0x02, audio_codec_index_02h);
		audio_codec_index_0ch = 0x0010;
		hal_rtl_audio_si_write(paudio_adapter, 0x0c, audio_codec_index_0ch);

		//Step2:
		audio_codec_index_00h = (0x731b | input_index_00h);
		hal_rtl_audio_si_write(paudio_adapter, 0x00, audio_codec_index_00h);

		//Step3:
		audio_codec_index_00h = (0x739b | input_index_00h);
		hal_rtl_audio_si_write(paudio_adapter, 0x00, audio_codec_index_00h);
		audio_codec_index_0ch = 0x0018;
		hal_rtl_audio_si_write(paudio_adapter, 0x0c, audio_codec_index_0ch);

		//Step4:
		hal_delay_ms(50);

		//Step5:
		audio_codec_index_00h = (0x731b | input_index_00h);
		hal_rtl_audio_si_write(paudio_adapter, 0x00, audio_codec_index_00h);

		//Step6:
		audio_codec_index_00h = (0x931b | input_index_00h);
		hal_rtl_audio_si_write(paudio_adapter, 0x00, audio_codec_index_00h);
		audio_codec_index_01h = 0x1fff;
		hal_rtl_audio_si_write(paudio_adapter, 0x01, audio_codec_index_01h);

		//Step7:
		audio_codec_index_00h = (0x939b | input_index_00h);
		hal_rtl_audio_si_write(paudio_adapter, 0x00, audio_codec_index_00h);

		//Step8:
		hal_delay_ms(5);

		//Step9:
		audio_codec_index_01h = 0x04fe;
		hal_rtl_audio_si_write(paudio_adapter, 0x01, audio_codec_index_01h);

		//Step10:
		audio_codec_index_00h = (0x121b | input_index_00h);
		hal_rtl_audio_si_write(paudio_adapter, 0x00, audio_codec_index_00h);

	} else if (output_mode == AUDIO_OUTPUT_DISABLE) {

		DBG_AUDIO_INFO(" hal_audio_output_power, AUDIO_OUTPUT_DISABLE\r\n");

		audio_codec_index_00h = hal_rtl_audio_si_read(paudio_adapter, 0x00);
		//audio_codec_index_01h = hal_rtl_audio_si_read(paudio_adapter, 0x01);
		audio_codec_index_02h = hal_rtl_audio_si_read(paudio_adapter, 0x02);

		audio_codec_index_00h = audio_codec_index_00h & 0x0FFF;
		hal_rtl_audio_si_write(paudio_adapter, 0x00, audio_codec_index_00h);
		audio_codec_index_01h = 0x0000;
		hal_rtl_audio_si_write(paudio_adapter, 0x01, audio_codec_index_01h);
		audio_codec_index_02h = audio_codec_index_02h & 0xFF00;
		hal_rtl_audio_si_write(paudio_adapter, 0x02, audio_codec_index_02h);

		hal_delay_ms(3);
	}

	if (output_mode != AUDIO_OUTPUT_DISABLE) {
		hal_rtl_audio_dac_clk(paudio_adapter, ENABLE);
		hal_rtl_audio_dac_mixer(paudio_adapter, DISABLE);
	} else {
		hal_rtl_audio_dac_clk(paudio_adapter, DISABLE);
		hal_rtl_audio_dac_mixer(paudio_adapter, ENABLE);
	}

