Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/system/component/soc/8735b/fwlib/rtl8735b/source/ram/rtl8735b_audio.c
}

/**
 *  @brief Control the input power.
 *
 *  @param[in] paudio_adapter The AUDIO adapter.
 *  @param[in] audio_input_mode_t Select the input mode.
 *
 *  @returns void
 */
void hal_rtl_audio_input_power(hal_audio_adapter_t *paudio_adapter, audio_input_mode_t input_mode)
{
	u16 audio_codec_index_02h;
	u16 audio_codec_index_03h;

	if ((input_mode == AUDIO_MIC_DIFFERENTIAL) || (input_mode == AUDIO_MIC_SINGLE_EDNED)) {

		//MICBAS POW
		hal_delay_us(1);
		audio_codec_index_02h = hal_rtl_audio_si_read(paudio_adapter, 0x02);
		audio_codec_index_02h |= AUDIO_CODEC_BIT_MICBIAS_ENCHX;
		audio_codec_index_02h |= AUDIO_CODEC_BIT_MICBIAS_POW;
		hal_rtl_audio_si_write(paudio_adapter, 0x02, audio_codec_index_02h);

		//MICBST POW
		hal_delay_us(2);
		audio_codec_index_03h = hal_rtl_audio_si_read(paudio_adapter, 0x03);
		audio_codec_index_03h |= AUDIO_CODEC_BIT_MICBST_POW;
		hal_rtl_audio_si_write(paudio_adapter, 0x03, audio_codec_index_03h);

		if (input_mode == AUDIO_MIC_DIFFERENTIAL) {
			DBG_AUDIO_INFO(" hal_rtl_audio_input_power, AUDIO_MIC_DIFFERENTIAL\r\n");
			hal_rtl_audio_mic_differential_mode(paudio_adapter, ENABLE);
		} else {
			DBG_AUDIO_INFO(" hal_rtl_audio_input_power, AUDIO_MIC_SINGLE_EDNED\r\n");
			hal_rtl_audio_mic_differential_mode(paudio_adapter, DISABLE);
		}

		hal_rtl_audio_adc_power(paudio_adapter, ENABLE);
		hal_rtl_audio_mic_boost(paudio_adapter, ENABLE, AUDIO_MIC_0DB);
		hal_rtl_audio_adc_clk(paudio_adapter, ENABLE, ENABLE);
		hal_rtl_audio_adc_amic_mixer(paudio_adapter, DISABLE, DISABLE);

		hal_rtl_audio_line_in_mute(paudio_adapter, ENABLE);
		hal_rtl_audio_mic_mute(paudio_adapter, DISABLE);

		hal_rtl_audio_mic_bias(paudio_adapter, ENABLE, AUDIO_BIAS_0p9_AVDD);
	} else if (input_mode == AUDIO_LINE_IN_MODE) {

		DBG_AUDIO_INFO(" hal_rtl_audio_input_power, AUDIO_LINE_IN_MODE\r\n");

		//MICBAS POW
		hal_delay_us(1);
		audio_codec_index_02h = hal_rtl_audio_si_read(paudio_adapter, 0x02);
		audio_codec_index_02h |= AUDIO_CODEC_BIT_MICBIAS_ENCHX;
		audio_codec_index_02h &= ~(AUDIO_CODEC_BIT_MICBIAS_POW);
		hal_rtl_audio_si_write(paudio_adapter, 0x02, audio_codec_index_02h);

		//MICBST POW
		hal_delay_us(2);
		audio_codec_index_03h = hal_rtl_audio_si_read(paudio_adapter, 0x03);
		audio_codec_index_03h &= ~(AUDIO_CODEC_BIT_MICBST_POW);
		hal_rtl_audio_si_write(paudio_adapter, 0x03, audio_codec_index_03h);

		hal_rtl_audio_adc_power(paudio_adapter, ENABLE);
		hal_rtl_audio_mic_boost(paudio_adapter, ENABLE, AUDIO_MIC_0DB);
		hal_rtl_audio_adc_clk(paudio_adapter, ENABLE, ENABLE);
		hal_rtl_audio_adc_amic_mixer(paudio_adapter, DISABLE, DISABLE);

		hal_rtl_audio_mic_mute(paudio_adapter, ENABLE);
		hal_rtl_audio_line_in_mute(paudio_adapter, DISABLE);
	} else if (input_mode == AUDIO_LEFT_DMIC) {
		DBG_AUDIO_INFO(" hal_rtl_audio_input_power, AUDIO_LEFT_DMIC\r\n");
		hal_rtl_audio_dmic_latch(paudio_adapter, AUDIO_DIMC_RISING, AUDIO_DIMC_FALLING);
		hal_rtl_audio_dmic_l_src(paudio_adapter, ENABLE, ENABLE, AUDIO_SRC_31p04KHZ);
		hal_rtl_audio_dmic_l_gain(paudio_adapter, AUDIO_DMIC_BOOST_0DB);
		hal_rtl_audio_dmic_input_clk(paudio_adapter, AUDIO_DMIC_2p5M);
		hal_rtl_audio_dmic_clk(paudio_adapter, ENABLE, DISABLE);
		hal_rtl_audio_adc_dmic_mixer(paudio_adapter, DISABLE, ENABLE);
	} else if (input_mode == AUDIO_RIGHT_DMIC) {
		DBG_AUDIO_INFO(" hal_rtl_audio_input_power, AUDIO_LEFT_DMIC\r\n");
		hal_rtl_audio_dmic_latch(paudio_adapter, AUDIO_DIMC_RISING, AUDIO_DIMC_FALLING);
		hal_rtl_audio_dmic_r_src(paudio_adapter, ENABLE, ENABLE, AUDIO_SRC_31p04KHZ);
		hal_rtl_audio_dmic_r_gain(paudio_adapter, AUDIO_DMIC_BOOST_0DB);
		hal_rtl_audio_dmic_input_clk(paudio_adapter, AUDIO_DMIC_2p5M);
		hal_rtl_audio_dmic_clk(paudio_adapter, DISABLE, ENABLE);
		hal_rtl_audio_adc_dmic_mixer(paudio_adapter, ENABLE, DISABLE);
	} else if (input_mode == AUDIO_STEREO_DMIC) {
		DBG_AUDIO_INFO(" hal_rtl_audio_input_power, AUDIO_LEFT_DMIC\r\n");
		hal_rtl_audio_dmic_latch(paudio_adapter, AUDIO_DIMC_RISING, AUDIO_DIMC_FALLING);
		hal_rtl_audio_dmic_l_src(paudio_adapter, ENABLE, ENABLE, AUDIO_SRC_31p04KHZ);
		hal_rtl_audio_dmic_l_gain(paudio_adapter, AUDIO_DMIC_BOOST_0DB);
		hal_rtl_audio_dmic_r_src(paudio_adapter, ENABLE, ENABLE, AUDIO_SRC_31p04KHZ);
		hal_rtl_audio_dmic_r_gain(paudio_adapter, AUDIO_DMIC_BOOST_0DB);
		hal_rtl_audio_dmic_input_clk(paudio_adapter, AUDIO_DMIC_2p5M);
		hal_rtl_audio_dmic_clk(paudio_adapter, ENABLE, ENABLE);
		hal_rtl_audio_adc_dmic_mixer(paudio_adapter, DISABLE, DISABLE);
	} else if (input_mode == AUDIO_INPUT_DISABLE) {
		DBG_AUDIO_INFO(" hal_rtl_audio_input_power, AUDIO_INPUT_DISABLE\r\n");
		hal_rtl_audio_mic_mute(paudio_adapter, ENABLE);
		hal_rtl_audio_line_in_mute(paudio_adapter, ENABLE);
		hal_rtl_audio_adc_amic_mixer(paudio_adapter, ENABLE, ENABLE);
		hal_rtl_audio_adc_clk(paudio_adapter, DISABLE, DISABLE);
		hal_rtl_audio_mic_boost(paudio_adapter, DISABLE, AUDIO_MIC_0DB);
		hal_rtl_audio_adc_power(paudio_adapter, DISABLE);

		hal_rtl_audio_adc_dmic_mixer(paudio_adapter, ENABLE, ENABLE);
		hal_rtl_audio_dmic_l_src(paudio_adapter, DISABLE, DISABLE, AUDIO_SRC_31p04KHZ);
		hal_rtl_audio_dmic_l_src(paudio_adapter, DISABLE, DISABLE, AUDIO_SRC_31p04KHZ);
		hal_rtl_audio_dmic_clk(paudio_adapter, DISABLE, DISABLE);
	}

}

/**
 *  @brief Control the capless mode of the headphone.
 *
 *  @param[in] paudio_adapter The AUDIO adapter.
 *  @param[in] left_en The left channel control: 0 is disable, 1 is enable.
 *
 *  @returns void
 */
void hal_rtl_audio_hpo_capless_mode(hal_audio_adapter_t *paudio_adapter, BOOL left_en)
{
	u16 audio_codec_index_00h;

	audio_codec_index_00h = hal_rtl_audio_si_read(paudio_adapter, 0x00);

	audio_codec_index_00h &= ~(AUDIO_CODEC_BIT_HPO_CLL);
	audio_codec_index_00h |= (left_en << AUDIO_CODEC_SHIFT_HPO_CLL);

	hal_rtl_audio_si_write(paudio_adapter, 0x00, audio_codec_index_00h);
}

/**
 *  @brief Control the depop of the headphone in the capless mode.
 *
 *  @param[in] paudio_adapter The AUDIO adapter.
 *  @param[in] left_en The left channel control: 0 is no depop, 1 is depop.
 *
 *  @returns void
 */
void hal_rtl_audio_hpo_capless_depop(hal_audio_adapter_t *paudio_adapter, BOOL left_en)
{
	u16 audio_codec_index_00h;

	audio_codec_index_00h = hal_rtl_audio_si_read(paudio_adapter, 0x00);

