Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/system/component/soc/8735b/fwlib/rtl8735b/source/ram/rtl8735b_audio.c
	audio_codec_index_00h &= ~(AUDIO_CODEC_BIT_HPO_CLNDPL | AUDIO_CODEC_BIT_HPO_CLPDPL);
	audio_codec_index_00h |= (left_en << AUDIO_CODEC_SHIFT_HPO_CLNDPL);
	audio_codec_index_00h |= (left_en << AUDIO_CODEC_SHIFT_HPO_CLPDPL);

	hal_rtl_audio_si_write(paudio_adapter, 0x00, audio_codec_index_00h);
}

/**
 *  @brief Control the amplifier of the headphone.
 *
 *  @param[in] paudio_adapter The AUDIO adapter.
 *  @param[in] left_en The left channel control: 0 is disable, 1 is enable.
 *
 *  @returns void
 */
void hal_rtl_audio_hpo_amplifier(hal_audio_adapter_t *paudio_adapter, BOOL left_en)
{
	u16 audio_codec_index_01h;

	audio_codec_index_01h = hal_rtl_audio_si_read(paudio_adapter, 0x01);

	audio_codec_index_01h &= ~(AUDIO_CODEC_BIT_HPO_ENAL);
	audio_codec_index_01h |= (left_en << AUDIO_CODEC_SHIFT_HPO_ENAL);

	hal_rtl_audio_si_write(paudio_adapter, 0x01, audio_codec_index_01h);
}

/**
 *  @brief Control the depop mode of the headphone.
 *
 *  @param[in] paudio_adapter The AUDIO adapter.
 *  @param[in] left_en The left channel control: 0 is disable, 1 is enable.
 *
 *  @returns void
 */
void hal_rtl_audio_hpo_depop(hal_audio_adapter_t *paudio_adapter, BOOL left_en)
{
	u16 audio_codec_index_01h;

	audio_codec_index_01h = hal_rtl_audio_si_read(paudio_adapter, 0x01);

	audio_codec_index_01h &= ~(AUDIO_CODEC_BIT_HPO_ENDPL);
	audio_codec_index_01h |= (left_en << AUDIO_CODEC_SHIFT_HPO_ENDPL);

	hal_rtl_audio_si_write(paudio_adapter, 0x01, audio_codec_index_01h);
}

/**
 *  @brief Control the headphone power.
 *
 *  @param[in] paudio_adapter The AUDIO adapter.
 *  @param[in] left_en The left channel control: 0 is disable, 1 is enable.
 *
 *  @returns void
 */
void hal_rtl_audio_hpo_power(hal_audio_adapter_t *paudio_adapter, BOOL left_en)
{
	u16 audio_codec_index_01h;

	audio_codec_index_01h = hal_rtl_audio_si_read(paudio_adapter, 0x01);

	audio_codec_index_01h &= ~(AUDIO_CODEC_BIT_HPO_L_POW);
	audio_codec_index_01h |= (left_en << AUDIO_CODEC_SHIFT_HPO_L_POW);

	hal_rtl_audio_si_write(paudio_adapter, 0x01, audio_codec_index_01h);
}

/**
 *  @brief Control the depop of the headphone mute.
 *
 *  @param[in] paudio_adapter The AUDIO adapter.
 *  @param[in] left_en The left channel control: 0 is no depop, 1 is depop.
 *
 *  @returns void
 */
void hal_rtl_audio_hpo_mute_depop(hal_audio_adapter_t *paudio_adapter, BOOL left_en)
{
	u16 audio_codec_index_01h;

	audio_codec_index_01h = hal_rtl_audio_si_read(paudio_adapter, 0x01);

	audio_codec_index_01h &= ~(AUDIO_CODEC_BIT_HPO_MDPL);
	audio_codec_index_01h |= (left_en << AUDIO_CODEC_SHIFT_HPO_MDPL);

	hal_rtl_audio_si_write(paudio_adapter, 0x01, audio_codec_index_01h);
}

/**
 *  @brief Control the depop of the headphone op.
 *
 *  @param[in] paudio_adapter The AUDIO adapter.
 *  @param[in] left_en The left channel control: 0 is no depop, 1 is depop.
 *
 *  @returns void
 */
void hal_rtl_audio_hpo_op_depop(hal_audio_adapter_t *paudio_adapter, BOOL left_en)
{
	u16 audio_codec_index_01h;

	audio_codec_index_01h = hal_rtl_audio_si_read(paudio_adapter, 0x01);

	audio_codec_index_01h &= ~(AUDIO_CODEC_BIT_HPO_OPNDPL | AUDIO_CODEC_BIT_HPO_OPPDPL);
	audio_codec_index_01h |= (left_en << AUDIO_CODEC_SHIFT_HPO_OPNDPL);
	audio_codec_index_01h |= (left_en << AUDIO_CODEC_SHIFT_HPO_OPPDPL);

	hal_rtl_audio_si_write(paudio_adapter, 0x01, audio_codec_index_01h);
}

/**
 *  @brief Control the headphone mute.
 *
 *  @param[in] paudio_adapter The AUDIO adapter.
 *  @param[in] left_mute_en The left channel control: 0 is disable, 1 is enable.
 *
 *  @returns void
 */
void hal_rtl_audio_hpo_mute(hal_audio_adapter_t *paudio_adapter, BOOL left_mute_en)
{
	u16 audio_codec_index_02h;

	audio_codec_index_02h = hal_rtl_audio_si_read(paudio_adapter, 0x02);

	audio_codec_index_02h &= ~(AUDIO_CODEC_MASK_HPO_ML);

	if (left_mute_en == 1) {
		audio_codec_index_02h |= (0x3 << AUDIO_CODEC_SHIFT_HPO_ML);
	} else {
		audio_codec_index_02h |= (0x2 << AUDIO_CODEC_SHIFT_HPO_ML);
	}

	hal_rtl_audio_si_write(paudio_adapter, 0x02, audio_codec_index_02h);
}

/**
 *  @brief Control the headphone differential mode.
 *
 *  @param[in] paudio_adapter The AUDIO adapter.
 *  @param[in] left_en The left channel control: 0 is disable, 1 is enable.
 *
 *  @returns void
 */
void hal_rtl_audio_hpo_differential_mode(hal_audio_adapter_t *paudio_adapter, BOOL left_en)
{
	u16 audio_codec_index_02h;

	audio_codec_index_02h = hal_rtl_audio_si_read(paudio_adapter, 0x02);

	if (left_en == 1) {
		audio_codec_index_02h &= ~(AUDIO_CODEC_BIT_HPO_SEL);
	} else {
		audio_codec_index_02h |= AUDIO_CODEC_BIT_HPO_SEL;
	}

	hal_rtl_audio_si_write(paudio_adapter, 0x02, audio_codec_index_02h);
}

/**
 *  @brief Control the mic bias.
 *
 *  @param[in] paudio_adapter The AUDIO adapter.
 *  @param[in] bias_en Enable control: 0 is disable, 1 is enable.
 *  @param[in] bias_voltage Select the bias voltage.
 *                      -00: 0.9AVDD. (default)
 *                      -01: 0.86AVDD.
 *                      -10: 0.75AVDD.
 *                      -11: reserved.
 *
 *  @returns void
 */
void hal_rtl_audio_mic_bias(hal_audio_adapter_t *paudio_adapter, BOOL bias_en, audio_bias_voltage_t bias_voltage)
{
	u16 audio_codec_index_02h;

	audio_codec_index_02h = hal_rtl_audio_si_read(paudio_adapter, 0x02);

	audio_codec_index_02h &= ~(AUDIO_CODEC_BIT_MICBIAS_POW);
	audio_codec_index_02h |= (bias_en << AUDIO_CODEC_SHIFT_MICBIAS_POW);

	audio_codec_index_02h &= ~(AUDIO_CODEC_MASK_MICBIAS_VSET);
	audio_codec_index_02h |= (bias_voltage << AUDIO_CODEC_SHIFT_MICBIAS_VSET);

	hal_rtl_audio_si_write(paudio_adapter, 0x02, audio_codec_index_02h);
}

/**
 *  @brief Control the mic differential mode.
 *
 *  @param[in] paudio_adapter The AUDIO adapter.
 *  @param[in] left_en The left channel control: 0 is disable, 1 is enable.
 *
 *  @returns void
 */
void hal_rtl_audio_mic_differential_mode(hal_audio_adapter_t *paudio_adapter, BOOL left_en)
{
	u16 audio_codec_index_02h;

	audio_codec_index_02h = hal_rtl_audio_si_read(paudio_adapter, 0x02);

	audio_codec_index_02h &= ~(AUDIO_CODEC_BIT_MICBST_ENDFL);
	audio_codec_index_02h |= (left_en << AUDIO_CODEC_SHIFT_MICBST_ENDFL);

	hal_rtl_audio_si_write(paudio_adapter, 0x02, audio_codec_index_02h);
}

/**
 *  @brief Control the mic mute.
 *
 *  @param[in] paudio_adapter The AUDIO adapter.
 *  @param[in] left_mute_en The left channel control: 0 is disable, 1 is enable.
 *
 *  @returns void
 */
void hal_rtl_audio_mic_mute(hal_audio_adapter_t *paudio_adapter, BOOL left_mute_en)
{
	u16 audio_codec_index_03h;

	audio_codec_index_03h = hal_rtl_audio_si_read(paudio_adapter, 0x03);

