Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/system/component/soc/8735b/fwlib/rtl8735b/source/ram/rtl8735b_audio.c
	audio_codec_index_03h &= ~(0x1 << AUDIO_CODEC_SHIFT_MICBST_MUTE_L);

	if (left_mute_en == 1) {
		audio_codec_index_03h |= (0x1 << AUDIO_CODEC_SHIFT_MICBST_MUTE_L);
	}

	hal_rtl_audio_si_write(paudio_adapter, 0x03, audio_codec_index_03h);
}

/**
 *  @brief Control the line-in mute.
 *
 *  @param[in] paudio_adapter The AUDIO adapter.
 *  @param[in] left_mute_en The left channel control: 0 is disable, 1 is enable.
 *
 *  @returns void
 */
void hal_rtl_audio_line_in_mute(hal_audio_adapter_t *paudio_adapter, BOOL left_mute_en)
{
	u16 audio_codec_index_03h;

	audio_codec_index_03h = hal_rtl_audio_si_read(paudio_adapter, 0x03);

	audio_codec_index_03h &= ~(0x2 << AUDIO_CODEC_SHIFT_MICBST_MUTE_L);

	if (left_mute_en == 1) {
		audio_codec_index_03h |= (0x2 << AUDIO_CODEC_SHIFT_MICBST_MUTE_L);
	}

	hal_rtl_audio_si_write(paudio_adapter, 0x03, audio_codec_index_03h);
}

/**
 *  @brief Control the mic power.
 *
 *  @param[in] paudio_adapter The AUDIO adapter.
 *  @param[in] left_en The left channel control: 0 is disable, 1 is enable.
 *  @param[in] left_gain Select the left channel gain.
 *                      -00: 0dB. (default)
 *                      -01: 20dB.
 *                      -10: 30dB.
 *                      -11: 40dB.
 *
 *  @returns void
 */
void hal_rtl_audio_mic_boost(hal_audio_adapter_t *paudio_adapter, BOOL left_en, audio_mic_gain_t left_gain)
{
	u16 audio_codec_index_03h;

	audio_codec_index_03h = hal_rtl_audio_si_read(paudio_adapter, 0x03);

	audio_codec_index_03h &= ~(AUDIO_CODEC_BIT_MICBST_POW);
	audio_codec_index_03h |= (left_en << AUDIO_CODEC_SHIFT_MICBST_POW);

	audio_codec_index_03h &= ~(AUDIO_CODEC_MASK_MICBST_GSELL);
	audio_codec_index_03h |= (left_gain << AUDIO_CODEC_SHIFT_MICBST_GSELL);

	hal_rtl_audio_si_write(paudio_adapter, 0x03, audio_codec_index_03h);
}

/**
 *  @brief Control the vref voltage.
 *
 *  @param[in] paudio_adapter The AUDIO adapter.
 *  @param[in] vref_en Enable control: 0 is disable, 1 is enable.
 *  @param[in] vref_voltage Select the bias voltage.
 *                      -00: 0.52VDD.
 *                      -01: 0.51VDD.
 *                      -10: 0.50VDD. (default)
 *                      -11: 0.49VDD.
 *
 *  @returns void
 */
void hal_rtl_audio_vref(hal_audio_adapter_t *paudio_adapter, BOOL vref_en, audio_vref_voltage_t vref_voltage)
{
	u16 audio_codec_index_02h;
	u16 audio_codec_index_03h;

	audio_codec_index_02h = hal_rtl_audio_si_read(paudio_adapter, 0x02);
	audio_codec_index_03h = hal_rtl_audio_si_read(paudio_adapter, 0x03);

	audio_codec_index_02h &= ~(AUDIO_CODEC_BIT_VREF_POW);
	audio_codec_index_02h |= (vref_en << AUDIO_CODEC_SHIFT_VREF_POW);

	audio_codec_index_03h &= ~(AUDIO_CODEC_MASK_VREF_VREFSEL);
	audio_codec_index_03h |= (vref_voltage << AUDIO_CODEC_SHIFT_VREF_VREFSEL);

	hal_rtl_audio_si_write(paudio_adapter, 0x02, audio_codec_index_02h);
	hal_rtl_audio_si_write(paudio_adapter, 0x03, audio_codec_index_03h);
}

/**
 *  @brief Control audio ip tcon
 *
 *  @param[in] paudio_adapter The AUDIO adapter.
 *  @param[in] en Control the enable.
 *
 *  @returns void
 */
void hal_rtl_audio_ip_tcon(hal_audio_adapter_t *paudio_adapter, BOOL en)
{
	u16 audio_codec_index_1bh;

	audio_codec_index_1bh = hal_rtl_audio_si_read(paudio_adapter, 0x1b);

	audio_codec_index_1bh &= ~(AUDIO_CODEC_BIT_AUDIO_IP_TCON_EN);
	audio_codec_index_1bh |= (en << AUDIO_CODEC_SHIFT_AUDIO_IP_TCON_EN);

	hal_rtl_audio_si_write(paudio_adapter, 0x1b, audio_codec_index_1bh);
}

/**
 *  @brief Initialize the sport and  DMA of the audio.
 *
 *  @param[in] paudio_adapter The AUDIO adapter.
 *
 *  @returns void
 */
void hal_rtl_audio_sport_init(hal_audio_adapter_t *paudio_adapter)
{
	hal_sport_adapter_t *psport_adapter = &paudio_adapter->sport_adapter;

	//Reset
	hal_rtl_sport_init(psport_adapter);
	hal_rtl_sport_reset_tx_fifo(psport_adapter);
	hal_rtl_sport_reset_rx_fifo(psport_adapter);
	hal_rtl_sport_dma_reset(psport_adapter);
	hal_rtl_sport_clean_tx_page_own(psport_adapter);
	hal_rtl_sport_clean_rx_page_own(psport_adapter);

	//Init setting
	hal_rtl_sport_set_master(psport_adapter, SPORT_MASTER_MODE);
	hal_rtl_sport_set_loopback(psport_adapter, DISABLE); //ENABLE, DISABLE
	hal_rtl_sport_mode(psport_adapter, SPORT_DMA_MODE);
	hal_rtl_sport_tx_ch(psport_adapter, SPORT_L_R);
	hal_rtl_sport_rx_ch(psport_adapter, SPORT_L_R);
	hal_rtl_sport_format(psport_adapter, SPORT_I2S);
	hal_rtl_sport_rx_same_format(psport_adapter, ENABLE);
	hal_rtl_sport_rx_format(psport_adapter, SPORT_I2S);

	hal_rtl_sport_tx_data_dir(psport_adapter, SPORT_MSB_FIRST, SPORT_MSB_FIRST);
	hal_rtl_sport_rx_data_dir(psport_adapter, SPORT_MSB_FIRST, SPORT_MSB_FIRST);
	hal_rtl_sport_tx_lr_swap(psport_adapter, DISABLE, DISABLE);
	hal_rtl_sport_rx_lr_swap(psport_adapter, DISABLE, DISABLE);

	hal_rtl_sport_tx_byte_swap(psport_adapter, DISABLE, DISABLE);
	hal_rtl_sport_rx_byte_swap(psport_adapter, DISABLE, DISABLE);
	hal_rtl_sport_bclk_inverse(psport_adapter, DISABLE);

	hal_rtl_sport_set_mclk(psport_adapter, SPORT_SRC_DIV_1, ENABLE);

	hal_rtl_sport_rx_same_mono_stereo(psport_adapter, DISABLE);

	//IRQ
	hal_rtl_sport_tx_fifo_th(psport_adapter, 16);
	hal_rtl_sport_rx_fifo_th(psport_adapter, 16);
	hal_rtl_sport_autoload_dma_burst(psport_adapter);

	//Enable SPORT TX and RX
	hal_rtl_sport_rx_start(psport_adapter, ENABLE);
	hal_rtl_sport_tx_start(psport_adapter, ENABLE);

}

/**
 *  @brief De-initialize of the audio SPORT hardware and turn off the audio SPORT.
 *
 *  @param[in] paudio_adapter The AUDIO adapter.
 *
 *  @returns void
 */
void hal_rtl_audio_sport_deinit(hal_audio_adapter_t *paudio_adapter)
{
	hal_sport_adapter_t *psport_adapter = &paudio_adapter->sport_adapter;

	hal_rtl_sport_deinit(psport_adapter);
}

/**
 *  @brief Set the tx SPORT parameter of the audio.
 *
 *  @param[in] paudio_adapter The AUDIO adapter.
 *  @param[in] ch The audio channel.
 *  @param[in] word_len The audio word length.
 *  @param[in] audio_sample_rate  Sample rate.
 *
 *  @returns void
 */
void hal_rtl_audio_sport_tx_params(hal_audio_adapter_t *paudio_adapter, audio_ch_t ch, audio_word_len_t word_len, audio_sample_rate_t audio_sample_rate)
{
	hal_sport_adapter_t *psport_adapter = &paudio_adapter->sport_adapter;
	hal_sport_tx_params_t tx_params;
	sport_cl_t cl_t;
	sport_dl_t dl_t;

	tx_params.sport_tx_ch = ch;

