Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/system/component/soc/8735b/fwlib/rtl8735b/source/ram/rtl8735b_audio.c
	cl_t = SPORT_CL_32BIT;
	dl_t = SPORT_DL_16BIT;

	if (word_len == AUDIO_WL_24) {
		dl_t = SPORT_DL_24BIT;
	}

	tx_params.sport_tx_cl = cl_t;
	tx_params.sport_tx0_dl = dl_t;
	tx_params.sport_tx1_dl = dl_t;
	tx_params.sport_tx_rate = audio_sample_rate;
	hal_rtl_sport_tx_params(psport_adapter, &tx_params);
}

/**
 *  @brief Set the rx SPORT parameter of the audio.
 *
 *  @param[in] paudio_adapter The AUDIO adapter.
 *  @param[in] ch The audio channel.
 *  @param[in] word_len The audio word length.
 *  @param[in] audio_sample_rate  Sample rate.
 *
 *  @returns void
 */
void hal_rtl_audio_sport_rx_params(hal_audio_adapter_t *paudio_adapter, audio_ch_t ch, audio_word_len_t word_len, audio_sample_rate_t audio_sample_rate)
{
	hal_sport_adapter_t *psport_adapter = &paudio_adapter->sport_adapter;
	hal_sport_rx_params_t rx_params;
	sport_cl_t cl_t;
	sport_dl_t dl_t;

	rx_params.sport_rx_ch = ch;

	cl_t = SPORT_CL_32BIT;
	dl_t = SPORT_DL_16BIT;

	if (word_len == AUDIO_WL_24) {
		dl_t = SPORT_DL_24BIT;
	}

	rx_params.sport_rx_cl = cl_t;
	rx_params.sport_rx0_dl = dl_t;
	rx_params.sport_rx1_dl = dl_t;
	rx_params.sport_rx_rate = audio_sample_rate;
	hal_rtl_sport_rx_params(psport_adapter, &rx_params);
}

/**
 *  @brief Initialize the buffer of the audio.
 *
 *  @param[in] paudio_adapter The AUDIO adapter.
 *  @param[in] dma_params The AUDIO adapter. Set tx0_buf pointer, rx0_buf pointer, page_num and page_size.
 *
 *  @returns void
 */
void hal_rtl_audio_sport_buf(hal_audio_adapter_t *paudio_adapter, hal_audio_dma_params_t dma_params)
{
	hal_sport_adapter_t *psport_adapter = &paudio_adapter->sport_adapter;
	hal_sport_buf_params_t buf_params;
	hal_sport_page_intr_t page_intr;

	page_intr.sport_p0ok = 0;
	page_intr.sport_p1ok = 0;
	page_intr.sport_p2ok = 0;
	page_intr.sport_p3ok = 0;
	page_intr.sport_p0unava = 0;
	page_intr.sport_p1unava = 0;
	page_intr.sport_p2unava = 0;
	page_intr.sport_p3unava = 0;
	page_intr.sport_p0err = 0;
	page_intr.sport_p1err = 0;
	page_intr.sport_p2err = 0;
	page_intr.sport_p3err = 0;
	page_intr.sport_fifo_err = 0;
	hal_rtl_sport_set_dma_intr(psport_adapter, SPORT_TX1, &page_intr);
	hal_rtl_sport_set_dma_intr(psport_adapter, SPORT_RX1, &page_intr);

	buf_params.tx0_buf = (u8 *)dma_params.tx_buf;
	buf_params.rx0_buf = (u8 *)dma_params.rx_buf;
	buf_params.tx1_buf = (u8 *)NULL;
	buf_params.rx1_buf = (u8 *)NULL;
	if ((dma_params.page_num < 5) && (dma_params.page_num > 1)) {
		buf_params.page_num = dma_params.page_num;

		if (dma_params.page_num == 4) {
			page_intr.sport_p0ok = 1;
			page_intr.sport_p1ok = 1;
			page_intr.sport_p2ok = 1;
			page_intr.sport_p3ok = 1;
			page_intr.sport_p0unava = 1;
			page_intr.sport_p1unava = 1;
			page_intr.sport_p2unava = 1;
			page_intr.sport_p3unava = 1;
			page_intr.sport_p0err = 1;
			page_intr.sport_p1err = 1;
			page_intr.sport_p2err = 1;
			page_intr.sport_p3err = 1;
		} else if (dma_params.page_num == 3) {
			page_intr.sport_p0ok = 1;
			page_intr.sport_p1ok = 1;
			page_intr.sport_p2ok = 1;
			page_intr.sport_p0unava = 1;
			page_intr.sport_p1unava = 1;
			page_intr.sport_p2unava = 1;
			page_intr.sport_p0err = 1;
			page_intr.sport_p1err = 1;
			page_intr.sport_p2err = 1;
		} else if (dma_params.page_num == 2) {
			page_intr.sport_p0ok = 1;
			page_intr.sport_p1ok = 1;
			page_intr.sport_p0unava = 1;
			page_intr.sport_p1unava = 1;
			page_intr.sport_p0err = 1;
			page_intr.sport_p1err = 1;
		}

		page_intr.sport_fifo_err = 1;
		hal_rtl_sport_set_dma_intr(psport_adapter, SPORT_TX0, &page_intr);
		hal_rtl_sport_set_dma_intr(psport_adapter, SPORT_RX0, &page_intr);
		buf_params.page_size = dma_params.page_size;
		hal_rtl_sport_dma_buffer(psport_adapter, &buf_params);
	} else {
		DBG_AUDIO_ERR(" hal_rtl_audio_dma_params, dma_params.page_num is invalid\r\n");
	}

}

/**
 *  @brief Register the audio SPORT TX IRQ callback function and argument.
 *
 *  @param[in] paudio_adapter The AUDIO adapter.
 *  @param[in]  callback The callback function.
 *  @param[in]  arg The callback argument.
 *  @returns void
 */
void hal_rtl_audio_sport_tx_cb_handler(hal_audio_adapter_t *paudio_adapter, audio_sport_irq_cb_t callback, u32 *arg)
{
	hal_sport_adapter_t *psport_adapter = &paudio_adapter->sport_adapter;

	hal_rtl_sport_tx0_dma_cb_handler(psport_adapter, (sport_irq_user_cb_t)callback, arg);
}

/**
 *  @brief Register the audio SPORT RX IRQ callback function and argument.
 *
 *  @param[in] paudio_adapter The AUDIO adapter.
 *  @param[in]  callback The callback function.
 *  @param[in]  arg The callback argument.
 *  @returns void
 */
void hal_rtl_audio_sport_rx_cb_handler(hal_audio_adapter_t *paudio_adapter, audio_sport_irq_cb_t callback, u32 *arg)
{
	hal_sport_adapter_t *psport_adapter = &paudio_adapter->sport_adapter;

	hal_rtl_sport_rx0_dma_cb_handler(psport_adapter, (sport_irq_user_cb_t)callback, arg);
}

/**
 *  @brief Get the current tx0 page address.
 *
 *  @param[in] paudio_adapter The AUDIO adapter.
 *
 *  @returns The address of current tx0 page or NULL.
 */
int *hal_rtl_audio_sport_get_tx_page(hal_audio_adapter_t *paudio_adapter)
{
	hal_sport_adapter_t *psport_adapter = &paudio_adapter->sport_adapter;

	return hal_rtl_sport_get_tx0_page(psport_adapter);
}

/**
 *  @brief Sets current tx page own by audio.
 *
 *  @param[in] paudio_adapter The AUDIO adapter.
 *  @param[in] pbuf  Set tx buffer adderss.
 *
 *  @returns void
 */
void hal_rtl_audio_sport_tx_page_send(hal_audio_adapter_t *paudio_adapter, u32 *pbuf)
{
	hal_sport_adapter_t *psport_adapter = &paudio_adapter->sport_adapter;

	hal_rtl_sport_tx0_page_send(psport_adapter, pbuf);
}

/**
 *  @brief Sets current rx page own by audio.
 *
 *  @param[in] paudio_adapter The AUDIO adapter.
 *
 *  @returns void
 */
u32 hal_rtl_audio_sport_rx_page_recv(hal_audio_adapter_t *paudio_adapter)
{
	hal_sport_adapter_t *psport_adapter = &paudio_adapter->sport_adapter;

	return hal_rtl_sport_rx0_page_recv(psport_adapter);
}

/**
 *  @brief Start the audio tx DMA.
 *
 *  @param[in] paudio_adapter The AUDIO adapter.
 *  @param[in] en Control the enable.
 *
 *  @returns void
 */
void hal_rtl_audio_sport_tx_dma_start(hal_audio_adapter_t *paudio_adapter, BOOL en)
{
	hal_sport_adapter_t *psport_adapter = &paudio_adapter->sport_adapter;

	hal_rtl_sport_tx_dma_start(psport_adapter, en);
}

/**
 *  @brief Start the audio rx DMA.
 *
 *  @param[in] paudio_adapter The AUDIO adapter.
 *  @param[in] en Control the enable.
 *
 *  @returns void
 */
void hal_rtl_audio_sport_rx_dma_start(hal_audio_adapter_t *paudio_adapter, BOOL en)
{
	hal_sport_adapter_t *psport_adapter = &paudio_adapter->sport_adapter;

	hal_rtl_sport_rx_dma_start(psport_adapter, en);
}

/**
 *  @brief Get the audio tx DMA status.
 *
 *  @param[in] paudio_adapter The AUDIO adapter.
 *  @param[in] en Control the enable.
 *
 *  @returns void
 */
u32 hal_rtl_audio_sport_get_tx_dma_start_sta(hal_audio_adapter_t *paudio_adapter)
{
	hal_sport_adapter_t *psport_adapter = &paudio_adapter->sport_adapter;

	return hal_rtl_sport_get_tx_dma_start_sta(psport_adapter);
}

/**
 *  @brief Get the audio rx DMA status.
 *
 *  @param[in] paudio_adapter The AUDIO adapter.
 *  @param[in] en Control the enable.
 *
 *  @returns void
 */
u32 hal_rtl_audio_sport_get_rx_dma_start_sta(hal_audio_adapter_t *paudio_adapter)
{
	hal_sport_adapter_t *psport_adapter = &paudio_adapter->sport_adapter;

	return hal_rtl_sport_get_rx_dma_start_sta(psport_adapter);
}

/**
 *  @brief Swap the byte of tx data.
 *
 *  @param[in] paudio_adapter The AUDIO adapter.
 *  @param[in] en Control the enable.
 *
 *  @returns void
 */
void hal_rtl_audio_sport_tx_byte_swap(hal_audio_adapter_t *paudio_adapter, BOOL en)
{
	hal_sport_adapter_t *psport_adapter = &paudio_adapter->sport_adapter;

	hal_rtl_sport_tx_byte_swap(psport_adapter, en, 0);
}

/**
 *  @brief Swap the byte of tx data.
 *
 *  @param[in] paudio_adapter The AUDIO adapter.
 *  @param[in] en Control the enable.
 *
 *  @returns void
 */
void hal_rtl_audio_sport_rx_byte_swap(hal_audio_adapter_t *paudio_adapter, BOOL en)
{
	hal_sport_adapter_t *psport_adapter = &paudio_adapter->sport_adapter;

	hal_rtl_sport_rx_byte_swap(psport_adapter, en, 0);
}

/**
 *  @brief Start the audio tx SPORT.
 *
 *  @param[in] paudio_adapter The AUDIO adapter.
 *  @param[in] en Control the enable.
 *
 *  @returns void
 */
void hal_rtl_audio_sport_tx_start(hal_audio_adapter_t *paudio_adapter, BOOL en)
{
	hal_sport_adapter_t *psport_adapter = &paudio_adapter->sport_adapter;

	hal_rtl_sport_tx_start(psport_adapter, en);
}

/**
 *  @brief Start the audio rx SPORT.
 *
 *  @param[in] paudio_adapter The AUDIO adapter.
 *  @param[in] en Control the enable.
 *
 *  @returns void
 */
void hal_rtl_audio_sport_rx_start(hal_audio_adapter_t *paudio_adapter, BOOL en)
{
	hal_sport_adapter_t *psport_adapter = &paudio_adapter->sport_adapter;

	hal_rtl_sport_rx_start(psport_adapter, en);
}

/**
 *  @brief Init the tx and rx different rate.
 *
 *  @param[in] paudio_adapter The AUDIO adapter.
 *  @param[in] en Control the enable.
 *
 *  @returns void
 */
void hal_rtl_audio_sport_diff_rate_init(hal_audio_adapter_t *paudio_adapter, BOOL en)
{
	hal_sport_adapter_t *psport_adapter = &paudio_adapter->sport_adapter;

	hal_rtl_sport_format(psport_adapter, SPORT_I2S);
	hal_rtl_sport_rx_format(psport_adapter, SPORT_I2S);

	if (en == ENABLE) {
		hal_rtl_sport_fixed_bclk(psport_adapter, ENABLE, SPORT_BCLK_1D4);
		hal_rtl_sport_rx_same_format(psport_adapter, DISABLE);
		hal_rtl_sport_rx_same_fs(psport_adapter, DISABLE);

	} else {
		hal_rtl_sport_fixed_bclk(psport_adapter, DISABLE, SPORT_BCLK_1D4);
		hal_rtl_sport_rx_same_format(psport_adapter, ENABLE);
		hal_rtl_sport_rx_same_fs(psport_adapter, ENABLE);
	}
}

/**
 *  @brief Set EQ register
 *
 *  @param[in] paudio_adapter The AUDIO adapter.
 *  @param[in] start_adr start address.
 *  @param[in] data value.
 *
 *  @returns void
 */
void hal_rtl_set_eq_reg(hal_audio_adapter_t *paudio_adapter, u32 start_adr, u32 data)
{
	u16 audio_codec_index_l;
	u16 audio_codec_index_h;

