Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/system/component/soc/8735b/fwlib/rtl8735b/source/ram/rtl8735b_audio.c
	audio_codec_index_l = hal_rtl_audio_si_read(paudio_adapter, start_adr);
	audio_codec_index_l &= ~(AUDIO_CODEC_MASK_ADC_L_BIQUAD_H0_1_BIT15TO0);
	audio_codec_index_l |= ((data & 0xFFFF) << AUDIO_CODEC_SHIFT_ADC_L_BIQUAD_H0_1_BIT15TO0);
	hal_rtl_audio_si_write(paudio_adapter, start_adr, audio_codec_index_l);

	audio_codec_index_h = hal_rtl_audio_si_read(paudio_adapter, (start_adr + 1));
	audio_codec_index_h &= ~(AUDIO_CODEC_MASK_ADC_L_BIQUAD_H0_1_BIT28TO16);
	audio_codec_index_h |= (((data >> 16) & 0x1FFF) << AUDIO_CODEC_SHIFT_ADC_L_BIQUAD_H0_1_BIT28TO16);
	hal_rtl_audio_si_write(paudio_adapter, (start_adr + 1), audio_codec_index_h);

}

/**
 *  @brief Set EQ parameter
 *
 *  @param[in] paudio_adapter The AUDIO adapter.
 *  @param[in] en Enable or Disable.
 *  @param[in] first_gp_adr First group address.
 *  @param[in] peq_params EQ parameter.
 *
 *  @returns void
 */
void hal_rtl_set_eq_para(hal_audio_adapter_t *paudio_adapter, BOOL en, u32 first_gp_adr, hal_eq_params_t *peq_params)
{
	u16 audio_codec_index_en;

	//disable the EQ before setting
	audio_codec_index_en = hal_rtl_audio_si_read(paudio_adapter, (first_gp_adr + 9));
	audio_codec_index_en &= ~(AUDIO_CODEC_BIT_ADC_L_BIQUAD_EN_1);
	hal_rtl_audio_si_write(paudio_adapter, (first_gp_adr + 9), audio_codec_index_en);

	//h0
	hal_rtl_set_eq_reg(paudio_adapter, first_gp_adr, peq_params->h0);
	//b1
	hal_rtl_set_eq_reg(paudio_adapter, (first_gp_adr + 2), peq_params->b1);
	//b2
	hal_rtl_set_eq_reg(paudio_adapter, (first_gp_adr + 4), peq_params->b2);
	//a1
	hal_rtl_set_eq_reg(paudio_adapter, (first_gp_adr + 6), peq_params->a1);
	//a2
	hal_rtl_set_eq_reg(paudio_adapter, (first_gp_adr + 8), peq_params->a2);

	audio_codec_index_en = hal_rtl_audio_si_read(paudio_adapter, (first_gp_adr + 9));
	audio_codec_index_en &= ~(AUDIO_CODEC_BIT_ADC_L_BIQUAD_EN_1);
	hal_rtl_audio_si_write(paudio_adapter, (first_gp_adr + 9), audio_codec_index_en);

	if (en == ENABLE) {
		audio_codec_index_en = hal_rtl_audio_si_read(paudio_adapter, (first_gp_adr + 9));
		audio_codec_index_en |= (1 << AUDIO_CODEC_SHIFT_ADC_L_BIQUAD_EN_1);
		hal_rtl_audio_si_write(paudio_adapter, (first_gp_adr + 9), audio_codec_index_en);
	}

}

/**
 *  @brief Set input 5-band equalizers for the left channel
 *
 *  @param[in] paudio_adapter The AUDIO adapter.
 *  @param[in] audio_eq Select the EQ number.
 *  @param[in] en Enable or Disable.
 *  @param[in] peq_params EQ parameter.
 *
 *  @returns void
 */
void hal_rtl_audio_input_l_eq(hal_audio_adapter_t *paudio_adapter, audio_eq_t audio_eq, BOOL en, hal_eq_params_t *peq_params)
{
	u16 audio_codec_index_en;

	if (audio_eq == AUDIO_EQ_0) {
		hal_rtl_set_eq_para(paudio_adapter, en, 0x91, peq_params);
	} else if (audio_eq == AUDIO_EQ_1) {
		hal_rtl_set_eq_para(paudio_adapter, en, 0x9B, peq_params);
	} else if (audio_eq == AUDIO_EQ_2) {
		hal_rtl_set_eq_para(paudio_adapter, en, 0xA5, peq_params);
	} else if (audio_eq == AUDIO_EQ_3) {
		hal_rtl_set_eq_para(paudio_adapter, en, 0xAF, peq_params);
	} else if (audio_eq == AUDIO_EQ_4) {
		hal_rtl_set_eq_para(paudio_adapter, en, 0xB9, peq_params);
	}
}

/**
 *  @brief Set input 5-band equalizers for the right channel
 *
 *  @param[in] paudio_adapter The AUDIO adapter.
 *  @param[in] audio_eq Select the EQ number.
 *  @param[in] en Enable or Disable.
 *  @param[in] peq_params EQ parameter.
 *
 *  @returns void
 */
void hal_rtl_audio_input_r_eq(hal_audio_adapter_t *paudio_adapter, audio_eq_t audio_eq, BOOL en, hal_eq_params_t *peq_params)
{
	u16 audio_codec_index_en;

	if (audio_eq == AUDIO_EQ_0) {
		hal_rtl_set_eq_para(paudio_adapter, en, 0xC4, peq_params);
	} else if (audio_eq == AUDIO_EQ_1) {
		hal_rtl_set_eq_para(paudio_adapter, en, 0xCE, peq_params);
	} else if (audio_eq == AUDIO_EQ_2) {
		hal_rtl_set_eq_para(paudio_adapter, en, 0xD8, peq_params);
	} else if (audio_eq == AUDIO_EQ_3) {
		hal_rtl_set_eq_para(paudio_adapter, en, 0xE2, peq_params);
	} else if (audio_eq == AUDIO_EQ_4) {
		hal_rtl_set_eq_para(paudio_adapter, en, 0xEC, peq_params);
	}
}

/**
 *  @brief Set output 5-band equalizers for the left channel
 *
 *  @param[in] paudio_adapter The AUDIO adapter.
 *  @param[in] audio_eq Select the EQ number.
 *  @param[in] en Enable or Disable.
 *  @param[in] peq_params EQ parameter.
 *
 *  @returns void
 */
void hal_rtl_audio_output_l_eq(hal_audio_adapter_t *paudio_adapter, audio_eq_t audio_eq, BOOL en, hal_eq_params_t *peq_params)
{
	u16 audio_codec_index_en;

	if (audio_eq == AUDIO_EQ_0) {
		hal_rtl_set_eq_para(paudio_adapter, en, 0x2B, peq_params);
	} else if (audio_eq == AUDIO_EQ_1) {
		hal_rtl_set_eq_para(paudio_adapter, en, 0x35, peq_params);
	} else if (audio_eq == AUDIO_EQ_2) {
		hal_rtl_set_eq_para(paudio_adapter, en, 0x3F, peq_params);
	} else if (audio_eq == AUDIO_EQ_3) {
		hal_rtl_set_eq_para(paudio_adapter, en, 0x49, peq_params);
	} else if (audio_eq == AUDIO_EQ_4) {
		hal_rtl_set_eq_para(paudio_adapter, en, 0x53, peq_params);
	}
}

